[
    {
        "body": "I was on a girls holiday and we had made friends with one of the bar staff and invited them back to the caravan for some drinks, I had go in to my room to put my pj on and this boy follow me and forced himself onto me I was terrified to say no because of how drunk I was. I had a boyfriend at the time and when he found out he went round saying I was cheating on him and didn’t make sure I was okay",
        "date": "APRIL 24 2023",
        "location": "ENGLAND"
    },
    {
        "body": "I was dating a lad I met of a friend (never met him) and at the start he was very nice and loving. Always caree about what I had to say and my opinions. Then around 2-3 weeks into the relationship he started to act weird. Causing aurgements over having boy mates, saying hi to a boy. Literally the smallest things ever. He started sending me pictures of knives and threatening me with them. Then one day we had a really bad aurgement over a boy making me uncomfortable. He started getting really mad calling me names, showing my knives, telling me to shut up or fuck off. I left him alone for abit to cool off, then [date omitted to preserve anonymity] I got a text from him saying \"im so sorry about what happened babe. To make it up to you. Ill come meet you.\" I was suspicious but forgot about it soon. I met him at a local shop near my house. I saw him, I ran up to him and went to hug him. Then I realised he had a knife in his hand. He pressed it up against my back and said \"better fucking behave\" I immediately froze. I was terrified. We got on a bus back to his house it was a large house but not very large. His room was painted a beige colour and he had a desk next to his bed and a window. He pushed me up against thr bed. Pinned my hands above my head against the wall. N started taking our clothes off. I started kicking. Really hard. And he got more and more pissed and proceeded to molest me. I can remember a pain in my stomach and back. And can remember blood everywhere. I cried. And cried. And cried. He held me and fell asleep when he was done. I manged to get off him without waking him up and jumping out the window. I still had like 20 quid on me so I ran to the bus stop n caught a bus back home.",
        "date": "APRIL 24 2023",
        "location": "TUNISIA"
    },
    {
        "body": "In [date omitted to preserve anonymity], during some lessons there was a person i was sitting next to that would grope me - rubbing/ grabbing my thighs, grabbing my but when standing or going to sit down even on a few occasions going to grab my privates (i am a male)",
        "date": "APRIL 23 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "when i reported my assault to my school after an extremely triggering “sexual assault awareness assembly”, i was told by the “safeguarding” team that it would be dealt with , i wouldn’t be blamed and that they would do something about it. none of the above happened. i was told that both me and the perpetrator of my assault had “lessons to learn” , i was told to “go home put my pajamas on and watch a chick flick” to feel better and this boy is still in the school. [date omitted to preserve anonymity] i was told to “stop gossiping” about him as it has a “bad reprimand” on him, simply for telling my story. he still walks through the school building an innocent man as if he didn’t damage me permanently, and this is purely because the school showed him no consequences .",
        "date": "APRIL 23 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "at school i got pulled into a cupboard and pushed in to a wall i was physically touched and was really uncomfortable the person who did that has now left but i’ve never really talked about it people don’t realise how badly it affects someone",
        "date": "APRIL 23 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I don't know if this was proper assault but I'm still I'm still gonna say it one day in [date omitted to preserve anonymity] seven I was walking up to my class when one of my teachers looked up a girls skirt I never thought it would happen to me untill a [date omitted to preserve anonymity] in year 7 still I was walking up the stairs and had a gut feeling something was wrong I turned around to see that same teacher behind me and I just knew he was doing the same thing I ran to the bathroom in shock I told my head of form yet he did nothing.A [date omitted to preserve anonymity] my pe teacher came into the changing rooms whilst I was only in my bra and others with only a bra and underwear on I was uncomfortable but I let it go as I knew nothing would happend later in the lesson we was playing tennis and as my skirt was my old one as I couldn't find my normal one the ball was on the floor and as I picked it up when I looked up I saw my teacher who was obviously looking down there look back up and smile at me it was so horrific. Another time I felt uncomfortable was when I was in year six and my \"boyfriend\" at the time who was a few months younger than me, we went to the river near my house and we was alone and we was playing tag in the water except when he was tag he started touching me in my private parts multiple times I told him to stop but he didn't get pulled me close to him and started to touch me but much more I started to cry but he didn't stop I tried to pull back and as soon as I did I ran home and I fell to the floor. I never told anyone. I know that this was long but if You read this just know it means a lot .<3",
        "date": "APRIL 23 2023",
        "location": "ENGLAND"
    },
    {
        "body": "when i was [date omitted to preserve anonymity] my best friend pressured me into doing things with her in the toilets. i thought i didnt have a choice. this went on for a month. when i told her i didnt want to do it anymore, she wouldnt talk to me until the [date omitted to preserve anonymity]",
        "date": "APRIL 23 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was six years old when I was first subjected to a form of assault by a family member. That person and I were playing a game. But then I accidentally fell so then they took that chance, pressed up against me, then proceeded to kiss me and touch me inappropriately. After that incident, they never touched me again. I thought this thing was normal and I basically almost did the same thing to my childhood best friend, but luckily they were smarter than me and said no.Then another few incidents happened when i was seven. My aunt had an in-house worker for 3years and all those years a was a victim of several assaults from them. Every time i met up or got babysat by said person I would get locked up in a room, they would make me straddle them and touch them. Then, [date omitted to preserve anonymity] after my 10th birthday, they resigned and went completely off radar. There was no hope for me.By the time i was 11 i survived different assaults from 4 people. some were related to me. Now, these [date omitted to preserve anonymity] have been oddly difficult. I finally told my mom about what happened to me and i felt at peace for the first day. But then a series of sexual harassment and catcalling started to unfold, and i have never ever felt so distraught. I feel as if im an alien in my own body, i feel disgusting, i feel sick to my stomach. My body has become this horrible non consensual orgy and i cannot handle anymore. I want an out, I don't want to go into the shower and scrub my skin till it starts to bleed every time i think of my first kiss. I never want to kiss or touch anyone ever again.",
        "date": "APRIL 23 2023",
        "location": "LEBANON"
    },
    {
        "body": "my ex and i used to fight a lot at school, one time a teacher saw and his head of year pulled him out of class to talk about consent. i realised what she had seen and i realised what he was doing wasn’t normal like he said it was. i wish someone would have spoke to me aswell because [date omitted to preserve anonymity] he sexually assaulted me in my own home and left me in hospital.",
        "date": "APRIL 23 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "There was this popular boy at my school, he was in all of my classes and always spoke to me saying horrible things one day he added me on snap so I added him back he was begging for noods and sending his noods. The [date omitted to preserve anonymity] at school he was being really weird looking me up and down and winking, break time came around and I had to go to the toilet n I only feel comfortable in the disabled toilets so I headed over there n he followed behind me but I didn’t seem him till it was to late, I walked into the bathroom but before I could shut the door he held it and walked in and closed the door behind him I was terrified. He then said “since you didn’t do as I told you to“ n from the rest was a burr all I remember was him taking his trousers off and me trying to back off into a corner n I was crying n shouting help. once it had happened I was shaking I went out the bathroom shaking n just scared of what could happen next",
        "date": "APRIL 22 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I used to read these in [date omitted to preserve anonymity] six and i sae my secondary and i js thought of it as a joke but i met a guy on snap that was in [date omitted to preserve anonymity] at my school meanwhile i was in year 7, we dated and got really serious but he would finger me in the cinema, at his mates house, in school he forced my head down and used all his strength to make me give him head, he gave me loads of hickey bruised all over my body, would strangle me and more. Climed into my bedroom once and he was waiting for a bus so i was js cleaning my room up while he was sitting on my bed and i turned around and he was wanking, all i could remember was him then forcing me to give him head, i never said yes to things but in a way i didnt know how to say no so i never know if it counts as assult and it keeps me up all night just thinking if it was my fault, the police got involved and now i regret it all so much because they say i asked for it or it looked like i wanted it. They dont believe me at all and they say i ruined his life. The school did nothing about it but give me a hard time by making me right statments and talk to them about it, i wore his hoodie around school and thats when they started calling me obsessed. I cant go anywhere without getting reminded of the things he did to me. My heart is racing even typing this but the police are currently downloading his phone because my mum told them to fuck off away from me and that there not aloud to have my phones and the police woman i was talking to had turned up at my school literally [date omitted to preserve anonymity] and for some reason i feel like something is gonna go against me when see sees his phone. I dont know what or how but i feel like this is gonna be bad and i have panic attacks everyday. I got drunk a [date omitted to preserve anonymity] and i ended up texting him and he told the police woman and shes now put me down for harrasment even tho i only messaged him 6 times and called him 3 screaming “i cant breathe a**** please im so sorry” and as a suicidal girl i feel like all this pressure is way too much for a 12 year old and i feel like killing myself because the police woman comes back.",
        "date": "APRIL 22 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "i was sexually assaulted for a year when i was 10 by another pupil. they would constantly put their hand down my skirt and when i would push them off they’d get physically and verbally abusive towards me.",
        "date": "APRIL 22 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was sat down in school with the girl I was with at the time and she stated to put her hands on me and I tried to move away but she held onto me so I couldn’t leave , the worst part is when I reposted it she got away with it because she was a teachers daughter , and it’s the fact she did it in my school uniform, the uniform I have to wear basically every day",
        "date": "APRIL 22 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "i (age:11) was playing with my friend (age:11) in a other friends house .we were having fun until he decided to start touching me inappropriately. he would touch my boobs and my bum i told him to stop but he found it funny . my other friend who is younger (age:10) also started to notice and started telling him to stop but he didnt . finally he did but to this day i still feel sick to my stomach when i think of it .",
        "date": "APRIL 22 2023",
        "location": "SCOTLAND"
    },
    {
        "body": "I was raped continuously throughout my 5 years at [organisation omitted to preserve anonymity] first school in [location omitted to preserve anonymity]. There was only one male teacher present at the school at the time and he seemed very nice and friendly, clearly not. He was a pedophile who unfortunately never got caught for his actions and moved away when he ran out of people to abuse. Noone at the school believed me when I told them about what he was doing because I was so young ( aged 5 - 9 years old ) and told me that I was just being silly and that he was \"helping\" as he was one of the only people at the school trained in first aid and he didn't teach any subjects, so he took the opportunity to whenever a child came in, rape them and say that it was helping. [organisation omitted to preserve anonymity] was such an amazing school when I went but eversince it has become a horrible school. I really hope that by adding it to the list people can see the damage that happens when they don't listen to children because they \"don't know what they are talking about and are to young to understand\"",
        "date": "APRIL 22 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I am 13 years old and I was out with my mates and I bummed into this guy we started talking and he seemed really nice he asked for my snap so I gave it him and we got closer until we started dating the first 3 months we’re amazing he treated me so well and it felt like I was worth something but then form the [date omitted to preserve anonymity] we started to argue everyday to the point where he would beat me and the arguments were mostly over the fact that I didn’t want to have sex with him he kept saying things like it’s all fine. Everyone does it and so on but I just kept replying saying I don’t want to just yet we haven’t been together long and I’m still really young and he used to get so ma diver it I just have in but then over time it just happens every single day and it was so draining he wouldn’t let me go out I had to be with him 2[date omitted to preserve anonymity]/7 and all he wanted was sex all the time and it got to paint where I told him I don’t want to anymore and one day he got so mad at it to the point where he grabbed me and choked me shouting your going to do what I say end of and he raped me. I still stayed with him for 4 months after that happened and I still saw him very say becuse whenever u tried to get away or break up with him he wouldn’t let me he would threaten me saying stuff like he was gunna kms if I left or he was gunna come to my house and I didn’t wanna be responsible for that he once sent me a video of him hanging himself to force me to get back with him and every time I gave in and I didn’t wanna tell anyone becuse I felt like they wouldn’t believe me but in the end I told my best mate and she took my phone and messaged him saying we’re over then blcoked him on every thing so he couldn’t message me but I was always in fear of the fact he would find a way to get in contact with me it’s been 3 months now since I broke up with him and I’m in many counciling sessions with people and it is helping me and this one teacher from my school have also reported him to police but they said they can’t do much becuse he’s a minor but he lives across the road from my school and he’s mates with alot of people in my school it’s terrifying when u see him outside waiting for them my heart drops every time I hate it and my school won’t tell him to leave or get off the site even tho they know everything that happens vacua’s he told everyone I was lying so I had to explain it to loads of people and he still won’t go away",
        "date": "APRIL 22 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "When I was a first year at [organisation omitted to preserve anonymity], I lived in the infamous [location omitted to preserve anonymity] and honestly I loved it. I was always a party girl and this new found freedom was magical to me. I had just got out of a relationship and I was on tinder a lot and I met up with a guy in my student accommodation let’s call him D, we had consensual sex a good few times at halloween time and after that we didn’t speak and honestly I had moved on with my life. After a while I noticed a lot of red flags in him and I just generally lost interest. When I got back from the christmas holidays I started buying weed from him and therefore out of necessity we’d talk occasionally (nothing flirty or even that friendly just civil). In [date omitted to preserve anonymity] he invited himself to an afters at my house at which I was very drunk, once the majority of people had gone home he was begging me to stay at mine “because his friends was sleeping in his bed” after saying no multiple times I eventually gave in under the understanding I just wanted to go to sleep. However once he got into my bed he wouldn’t leave me alone, grinding up against me and kissing my neck despite my protests. He then said he wouldn’t let me sleep till I’d had sex with him. This guy was a 6ft very big guy, and I mean weightlifter kinda build, I am fairly tall (5ft 8 ish) but at the time was only 62kg so I knew I couldn’t do anything to stop him. I kept saying no but he wouldn’t take it for an answer, he had raped me in my own bed and I question whether it was rape because I let it happen I guess but it was easier than fighting with him. I begged him to use a condom and not to cum in me but he listened to neither, I am greatful I never got pregnant/ an STD. But I cried for the entire day after and for months I felt so uncomfortable during sex. My body felt dirty and I have never felt so much like a slut, idk the fun stopped when I realised I didn’t even really have control over my own body anymore, I can’t even describe how worthless that made me feel. I think universities should make more of an effort to protect young students in halls because I know so many people who have been raped in those halls, it is up to [location omitted to preserve anonymity] uni to step up.",
        "date": "APRIL 22 2023",
        "location": "SCOTLAND"
    },
    {
        "body": "This will be a long story so I am sorry but I also thank you for taking the time to read this, in [date omitted to preserve anonymity] when I first joined my new secondary I had no friends and was just getting by (this was my first week in the school) I was lost in the corridor’s and a boy came up to me and asked if I were okay I explained I was lost so he took me to my class I thanked him, the [date omitted to preserve anonymity] he had found me again and asked if I wanted to join him for lunch I accepted and sat with him doing science work in one of the class rooms with a teacher, we got talking and he was in the year above me in [date omitted to preserve anonymity] the teacher had left and he had asked me to truant my next class I was skeptical but I wanted to make a new friend so after some persuasion I agreed, he took me into one of the bathrooms and locked the door (god knows why I agreed to that but I regret it) he took my phone from me and held it in the air and said “take your top off then you can have it back” I refused and tried to grab it but he pushed me away and threatened to drop it into the toilet so I tried grabbing it again and that’s when he grabbed me and started touching up my bum and saying how nice it was then he started to pull on my trousers button so I started to cry and I kicked him and he fell to the floor so I grabbed my bag and my phone and ran out of the bathroom the cameras outside the bathroom caught me running away with my trousers half down and with him chasing me begging me not to tell anyone I agreed and said i wouldn’t just to get him off my back. I walked into my classroom a mess and asked if I could talk to my teacher I had told her I needed to see the head and she agreed, police came to my house and questioned me and they gathered the cctv and my statement and he was expelled from the school only to come in for his GCSEs. [date omitted to preserve anonymity] I was getting ready to go to an apprenticeship interview and there I saw him in the entrance to the school he had seen me and he had made a “I will kill you” remark and I lost it I ran to my teacher having a panic attack and because of that I couldn’t go to my interview. Thankfully I have left now and I will never see that monster again.",
        "date": "APRIL 21 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "My last relationship was physically abusive. I’m quite mentally ill and they used this against me a lot. A lot of the time it would be ‘i’ll be quick’ or ‘you owe me it’ or ‘come on i know you want to’ kind of thing throughout. Then it came to it where they were telling me that if i don’t have sex with them they’ll tell authorities everything that i’ve done, probably resulting in me being in a hospital, so i was terrified of them and they raped me and i still get flashbacks when im not distracted. it just kind of creeps up on me. they made me lose all my friends and family and when i asked to leave the relationship they started a physical fight with me. Since, i have left the relationship but it still comes back in my mind everyday and i wish i left the relationship at the warning signs. anyway, thank you for reading if you did. sharing has taken a little weight off my shoulders",
        "date": "APRIL 21 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "This girl sexually harassed me on the [location omitted to preserve anonymity] staircase on my way to [location omitted to preserve anonymity] last period, no one cared nor believed me, not even my own friends, no one but myself. She spread rumours saying I was lying so I had a breakdown and told my parents, nothing has been resolved to this day, the school lie about how they help us.",
        "date": "APRIL 21 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was raped a while ago by a man a few years older than me, he held me captive in my university accommodation and forced me to perform degrading acts on him. All the while he was extremely aggressive and continually choked me, telling me that I better be a \"good girl\" for him or he'll hurt me badly. One key phrase also stuck in my mind, as he remarked that \"it's so cute how weak you are\" when he was raping me. I feel so ashamed having done what he said, and since then there have been multiple incidents of sexual assault from other men in moments when I least expect it. I can't seem to recover or trust men because every time I begin to feel confident in myself and my sexuality, someone takes away my autonomy in a brief moment with a gesture or action and I'm back to feeling helpless and ashamed. I don't want to feel weak but I've realised that I am in comparison to most men, if and when they'd like they can overpower me and I'll have no control over my own body and actions. I live in constant paranoia and fear of this.",
        "date": "APRIL 21 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "sexually harassed by a male friend multiple times",
        "date": "APRIL 21 2023",
        "location": "ENGLAND"
    },
    {
        "body": "i don’t really know how to word it over text but i was followed from the college to my car by an older student then attacked in the school car park",
        "date": "APRIL 20 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was sa by a boy at my primary school",
        "date": "APRIL 20 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was walking in the corridor by myself and a sixth former pulled down my tights and grabbed my bum and started squishing it for what felt like an eternity",
        "date": "APRIL 20 2023",
        "location": "IRELAND"
    },
    {
        "body": "I was touched by 3 teachers",
        "date": "APRIL 20 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was raped by a boy there and he sexually assaulted me multiple times and all they told him to do was not to do it. Fucking bullshit. Another boy is one of my exes and he keeps doing really sexual shit w me and kissing me and touching me. IN PUBLIC. He knows about my eating disorder and he said to me \"I'm going to kiss u and I hope it gives u the calories I just ate\" it wouldnt but it still was shit on me because it was like he didnt care at all. I had a forced relationship with another lad and he tried to kiss me multiple times in public. One boy in my classes, every single one who I see all day every day repeatedly asks if I cut myself which he knows I do and in front of groups of people he will say stuff like \"go slit ur wrists I hope u die\" and \"wrist reveal\" and \"do u cut urself\" and fucks sake it's so fucking annoying",
        "date": "APRIL 20 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "When I was in kindergarten there was a group of 3 children (boys) who liked to go around and put their hands under girls skirts and tickle you there. We were allaround 3 to 4 years old. I remember that I used to go to class in summer just wearing the apron of the uniform, which was basically as a dress, as it was too hot. Since this started happening I didn't want to do it anymore and didn't want to put skirts neither. I also remember that one day I entered the little wooden house we had in the garden and I saw the same 3 children and another girl of my age. My memory is vague at this point but I think they were undressing her and at some point somebody told a teacher that came and interrupted. Luckily this didn't affect me much, I barely recall it and I recall I was mainly annoied by these \"stupid guys\". But now that I am an adult it makes me wonder what made them come up with this, were they abused?",
        "date": "APRIL 20 2023",
        "location": "ITALY"
    },
    {
        "body": "I had a really bad day at school and i was extremely upset and exhausted and i had been crying and all my makeup and mascara was ruined so i felt very insecure and i had found out i had an hour’s detention [date omitted to preserve anonymity] and i tried to get out of it but they wouldnt let me but they did let me sit in the homework club room so i wouldnt have to see anybody i knew bc i said id felt insecure. Whilst i started doing homework in my detention a year [date omitted to preserve anonymity] boy came and sat next to me (im in year 9) he started talking to me and asking questions like “have you ever done anything your parents dont know about” and complimenting me over and over, i told him to be quiet because it started to annoy me and then i turned and looked at him and he was sat there playing with himself, he told me he had been doing it for 10 minutes and i told hom to stop and got up and left, as soon as i got out the room i told my head of year and since then nothing has been done, i still see him and despite my dad going into the school to talk about it hes still very much there and isnt going anywhere.",
        "date": "APRIL 20 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was 10 years old when this happened. It was break time, him and I were playing along with our mutual friend. We were roleplaying minecraft and the mutual ans I were leaning against a wall pretending to be asleep. I told him to not to anything whilst we were 'sleeping', taking into consideration that we were playing pretend. Nothing happened for a minute until I felt him touching my crotch. I immediately started laughing because I didnt know what he was doing and what actually happened. I joked about telling a teacher, but told him to not do it again since he was getting scared. Later at lunch, I don't remember this clearly, but he did it again and I told a dinner lady and she took me to the headteachers office. He just got told off and nothing else happened to him, but I still remember it everytime I see his face at school, it's almost been 8 years and I hate that it just got dismissed as him just being a boy and me not being taken seriously because I'm a girl. I would say I dont blame him since we were children, but the fact that he did it twice and he's a perverted person [date omitted to preserve anonymity] is what makes me not take his age into consideration.",
        "date": "APRIL 20 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "hi, i am a boy , 13 and in year 8 at [organisation omitted to preserve anonymity], most of the time in p.e the other boys grab my buldge or make sexual comments which make me quite uncomfortable.",
        "date": "APRIL 20 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was about 7 when I was first sexually abused. My parents had separated and I was with my dad at the weekend. He had a job to do at his cousin's house, and I was left to play with her secondary-school age son. At some point he convinced me to climb under his bed and help him with his homework. He then put a thermometer inside my vagina. I don't recall much about it, but know that he told me it should be a secret. The second instance was during my early teens, my second year of secondary school. I used to get off the bus at my grans house and stay with her until my mum got home. I would usually either go and sit in the kitchen or front room and watch telly. I don't remember the details of how it came about but I think it started that I'd always go and give my grandad a kiss on the cheek as a greeting when I came in, and he must have turned his face towards me one day. Eventually, it became that I would sit next to him on the sofa and he would kiss me inappropriately for minutes at a time. I don't remember when or why it stopped, but I just remember being glad it had. I felt so confused, was he cheating on my gran? I was only 12. I let both of these memories pass in to the distant memories of my early life as I had clearly decided to not report the behaviours so couldn't see any point in hashing it up in my mind. I didn't realise that I should have sought help for the mental repercussions, as I feel these two instances are the reason that I spent my teenage years putting myself in increasingly dangerous situations and having sex with strangers, being taken advantage of and being abused by men who took my lack of no to be a yes. I am now a stable, settled 30 year old and am married with two children and my husband is the kindest, most respectful and caring man you could meet. I am one of the lucky ones. Keep fighting everybody, and know that you can overcome what has been done to you.",
        "date": "APRIL 20 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was 14 years old. I had to sit next to this boy for the whole year in admin and I knew I couldn’t do anything about it or tell anybody because none of the teachers cared or would listen. I knew nobody would do anything about it so I just had to sit there and take it. I hated it, I hated him.",
        "date": "APRIL 20 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I use to go to this school I moved. It was a mixed school and I am a female, the uniform would be a jumper and really what ever bottoms. It was sunny pe day and I wore leggings. I was a third year at the time. I was walking in the morning when I felt the worse slap on my ass by a second year boy looking at me with a disgusting stare. He said oh I wish your top half looked as good as your bottom half. I was in disbelief so I walked away and scoffed. Not interested he noticed and said well you’re a fat bitch anyway.",
        "date": "APRIL 20 2023",
        "location": "IRELAND"
    },
    {
        "body": "If you are reading this thank you. I'll start by stating when this happened, I roughly remember my experience happened [date omitted to preserve anonymity] or [date omitted to preserve anonymity] i was in primary and it started when I was is in year 2 it continued until year 5. I had a classmate and anytime he sat next to me he would always touch my thigh and sometimes even put his hands down my pants and touch my private part, I felt disgusting I never told any[date omitted to preserve anonymity] because I always felt like I was going to be judged by the people around me at the time and I wasn't aware of what he was doing to me I was 7 or 8 at the time. He would also make me touch his penis because he wanted to feel 'excited' I always did what he asked me to do because I was scared of him, at the time he would hit me and punch me if I didn't listen to him. I would always arrive home with bruises on my arms my parents would ask me why i had bruises but I always lied to them by telling them I 'fell off' the swings. the touching got so bad over the [date omitted to preserve anonymity] he would sometimes finger me and tell me I felt 'nice' I would go home crying because I felt stupid for letting him do that, one day I went to school in a skirt and I sat next to him in class for our last lesson I had one of my girl classmates sit next to me so I could feel comfortable at that time she didn't know why I felt comfortable around her, it was [date omitted to preserve anonymity] before lesson ended the classmate next to me dropped her ruler so the guy obviously took advantage and went to 'pick' it up I was sitting there right in front of the ruler and he grabbed it and pushed the ruler right in between my legs I jolted out of my chair and told him I had enough he was begging me not to tell the teacher but I felt like I needed to do something so I went to the teacher and told her. She was furious with what I told her she immediately went up to him and pulled him out of class (she pulled me out of class as well) she asked me how long this was going on for and I told her 3 years she didn't hear his side of the story because she saw how I acted around him when he was near me. after minutes of waiting my mum got called and so did his the police got involved as well, in the end he got removed from school for 1 month and I got therapy for the rest of my school year. the feeling of him touching me is still engraved in my head and I cant get rid of it.",
        "date": "APRIL 19 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "This is about my first proper boyfriend. He lived about an hour away so to see him I would have to get a bus or train as neither of us had our license. He was pretty much my first everything. The first few times we had sex was entirely on my terms, he had done it before and so was okay with it. About two months into the relationship he started wanting to have sex a lot more. Every time I saw him the first thing he would try and do was have sex. Even if I was on my period or not in the mood. It got to the point where I never wanted to have sex, but he would always talk me into it. He would spend ages - up to 40 minutes one time - trying to get me to say yes. I always would, but that was because I was scared about how he would react if I carried on saying no. For four months of our relationship we only had fully consensual sex once. I started to think that was all he wanted from me, he wouldn't talk to me much during the day and then we were both back from school the conversations would always turn sexual, constantly asking for nudes and especially at night. He once held me by my neck during sex after I had continuously said I didn't want him to. I broke up with after six months. Right now, I am conflicted. I cant tell if what I experienced was sexual assault or not, because I would always say yes in the, even if I didn't want to and always after he would spend ages pressuring me into it.",
        "date": "APRIL 19 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was well um i was sexually assulted and rapes when i had ran away from home it has been almost a year and i still dont like talking about it or even like mentioning it but after i got comments in school like you have a nice ass or your lying or have you had sex or where did you go for too weeks or did you shag you bf i even got told once that me and my brother were having sex school wwas a bad experiance for me but this time [date omitted to preserve anonymity] was even worse",
        "date": "APRIL 19 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "The girls within my unit have constantly been harassed both sexually and otherwise by both male cadets and male members of staff throughout my time in the unit. From sexual conquest lists to being treated like objects of sexual desires we have faced many obstacles throughout. When reported to the staff the biggest consequence given was a verbal warning. Even though we all sat through a briefing at the start of the university year about how sexual harassment was not tolerated in the navy and that it would be instant dismissal. The staff wonder why we don't take welfare issues to them, but how can we if we don't feel like our voices can be heard. One incidence [date omitted to preserve anonymity] a major perpetrator of the sexual harassment was promoted into a position of leadership. One of the very people we are meant to go to when we have an issue. The staff even found what he did funny, Our commanding officer even referring to his sexual conquest list as his \"ultimate orgy list\". A member of staff once made me feel as though I hadn't earned my place in my unit fairly and suggested that my bruises were not from an obstacle course that I had just done but because I had a boyfriend. Repeatedly making comments similar to this even once I had made it clear that it was making me uncomfortable. I have faced multiple sexual harassment comments made by people who have previously been on verbal warnings. Proving that the welfare system doesn't work but when asked if we could change the system the staff close themselves off to protect themselves. The whole issue is perpetuated by the boys club in the leadership team. They just want to protect themselves. When it came out that a large percentage of the girls in the unit were unhappy and had complained we all received messages from the boys about how they felt they had done nothing wrong and why hadn't we told them before. When we had all tried on so many occasions. The fact that the person in charge of welfare [date omitted to preserve anonymity] was part of the 'boys club' only made the issue worse. The issue led to the involvement of one of the most senior officers involved in the organisation where their suggestion was to only give verbal warnings. Even though this contradicts all of the policies that the navy has. No action has been taken against the staff member that complaints were made against, not even a recognition of an email that was sent to the commanding officer where the staff member was named. It has all been hidden away in an attempt to protect careers above the welfare of the female cadets.",
        "date": "APRIL 18 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "a boy from year 13 at [location omitted to preserve anonymity] school in [location omitted to preserve anonymity] sexually assaulted me when I was very drunk. it was a one time fling that was terrifying. since then I have heard a number of varying allegations which have come from this same boy. no one has done anything. he has completely ruined my confidence and self esteem and I truly wish I was brave enough to tell someone.",
        "date": "APRIL 18 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was emotionally, financially and physically vulnerable at the time - at 15 my father had been jailed, our house, money and belongings repossessed and trying to carry on with education and life while hiding this situation from the small middle class white community we lived in and already felt alienated from. My mother who had not worked for +20yrs was also found guilty in the court case, while doing her court ordered community service hours she struggled to get a paid job to help provide for the household, claiming benefits and always counting her pennies; we were all trying our best to make ends meet and build a stable life again. At the time, I aspired to be a doctor just like some of the richest and smartest family members I had, and so pursued as much work experience and volunteering as I could. I joined a local disabled charity, one that ran weekly activities and summer camps for disabled children. All the volunteers were around my age and up to mid 20s, with the managers being from mid 20s to 40s. I was successful in the interview process and was onboarded into an establishment I could not have imagined existed given it is a charity with a mission to provide life-long support to the local disabled community. There was a clear position of power for the managers and leaders in their mid 20s, both directly and indirectly - in working conditions they were the boss, in social positions they would openly discuss the female volunteers sexually and compare us. On numerous occasions, 3 of the leaders leveraged settings like 1:1 car shares, 1:1 tasks that were away from the group, and after-work drinks to sexually harass and eventually sexually assault me which is the story I want to share. One of the leaders had been giving me a lot of attention - one on one I would receive flattery, kind words, sometimes tasteful jokes, but in group settings would find ways to make me feel small, weak and ugly amongst the other volunteers. Without realising, I was being groomed to yearn for his validation and make him happy; this went on 5days a week for 2months. Nearing the end of the summer camp, us volunteers and leaders were helping prepare the charity building for renovation - clearing out items and putting rubbish in skips, I was 16 and couldn't drive, so as per his information, I told my mother to pick me up at [date omitted to preserve anonymity]. As [date omitted to preserve anonymity] approached, the volunteers and leaders started grabbing their belongings and said their goodbyes, I called out to one of the leaders and said \"where's everyone going? [name omitted to preserve anonymity] told me we're finishing at [date omitted to preserve anonymity]\". That leader laughed and said \"no, we finish at [date omitted to preserve anonymity] but maybe he has something for you to do\", gave a smirk to two of the older boys and left with everyone. I wanted to text my mother to tell her to pick me up as soon as she can, it was only me and [name omitted to preserve anonymity] in the building, but he told me not to, gave me comforting words that he just wanted to spend some time with me without everyone getting in the way. He began touching my body. He described what he loved about my body, how he found me attractive and how much he liked me and began kissing my neck and then my lips, and pulled me into, what was, the soft play area. I said to him I felt uncomfortable, I felt weird and told him we should leave, it's weird and wrong to be doing this and asked him to stop. He used his winning tactic; he started demeaning me, compared me to the other women, and said in summary that he would humiliate me if I didn't put out. He started removing my clothes, I felt stuck. I was so groomed into doing what he wished. He removed his clothes and started touching himself, groping my body and muttering what he wanted to do to me. I was on my period and I was both scared he would see my pad and use that to humiliate me, but also hoped it would be a way to stop him. It didn't, he brought me to the floor, now on top of me, pinning me down, grinding on me and moaning, forcing his fingers inside me and then his dick and took my virginity. In a minute he finished inside me. My jeans were stained with both fresh blood and my period and I was in pain, was spacey and mute. He got dressed, and held me, comforted me. And told me to ask my mum to come pick me up. We waited in silence while he scrolled his phone walking in and out of the room. When my mum arrived I went out to her car and he went to his and we went our separate ways. I never shared this with my family. This was the beginning of a coercive relationship that spanned 2yrs. He would take pictures of me naked, post them on [organisation omitted to preserve anonymity] and threaten to share it with others if I didn't perform sexual acts on him. I was weak and let him have access to my body when he wanted and how he wanted. When I confided in a fellow female volunteer, the conversation was dismissed, she told me she was already aware that I was sleeping with [name omitted to preserve anonymity], \"everyone has had their time with [name omitted to preserve anonymity]\", he'd already been sleeping with her friends and even herself. She would flirt with him at work drinks, and resent when the boys would discuss the acts he would do to me. It was entertainment, and it became a competition of which girl is best in the sack. A new female volunteer joined, 16yo at the time, and she was the new girl he pursued, he would send me naked photos of her and ask me why I didn't have an amazing body like hers, he would describe how much better she was in bed, he shared his [organisation omitted to preserve anonymity] account that had hundreds of faceless nudes of other women he had fucked including her and me. And that day was when I realised I was part of his sick game. Even to this day I blame myself for being a part of this, for allowing him access to my body, and it's taken 10yrs and discussions in therapy to understand that what I experienced was sexual coercion, and I was targeted for my vulnerability. The charity community was in fact culpable, as I heard in our community socials, managers in their 40s would find entertainment in discussing the sexual acts these boys were doing to female volunteers. Even the father of one of the boys who was chairman of the charity would find these stories entertaining and high five the boys. Blurred lines and my not-so-aggressive approach to saying \"no\" was what made me feel like I am the one to blame. It destroyed my sense of self-worth, regularly considering suicide between 17 and 18yrs old, and even attempting at a nearby railway line near my house. I am grateful I have grown a thicker skin, I am grateful I have confidence to leave situations I don't feel comfortable and call out sexually coercive behaviour - but learning the hard way affected my youth and the healing process was painful. I was hiding a dark and painful life for years, I certainly didn't need it while my family and I were, and still are, rebuilding our lives after my fathers conviction and the subsequent repossession, and it didn't serve any good to my education.",
        "date": "APRIL 18 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I am in my 30s now but I have come to realise that I was sexually exploited as a teenager by my peers. I had never got into any trouble or had any real issues until I was [date omitted to preserve anonymity] [date omitted to preserve anonymity]. Around this age I started to self sabotage - drinking, smoking, skipping school, just not really caring about things. I can see now in hindsight that this was linked to unresolved issues around loss and death, but at the age of [date omitted to preserve anonymity] I didn't know why I was doing what I was doing and I just felt angry at the world. This time coincided with becoming romantically/sexually involved with boys from school but as the drinking increased, my power and control over my decisions diminished. I ended up with a reputation as a girl who would do sexual acts and boys would capitalise on that - waiting for me to be drunk and then getting me to do things when I could barely stand. As a young person I thought I had control and choice over this, and in some instances I still think I did but there was a whole bunch of situations where I can now see I was sexually assaulted. There were some times that I don't remember, or that I do remember parts of, and distinctly remember not wanting to do things and saying no, but they still happened. It was only recently that I saw one man who I went to school with, who I have not seen since leaving school, that it really hit me. I felt physically sick seeing him. I was dragged straight back to being 15 in a woodland to an experience I had not thought of in 20 years. It was then I started to think about other situations and other boys. I wonder if the boys think about it in the same way, or whether they still think of me as a drunk girl, a sure thing, as someone who is consenting through their actions of being too drunk to say no, consenting through their reputation. I started to think about the fact that the staff at the school must have known what was going on - I know they did as one particularly awful teacher commented on me being 'promiscuous' in a class once. I have gone on to have a very sucessful career where I support people, some of whom have experienced sexual abuse. Yet the realisation that I too was a victim or survivor (depending on what language you use) never hit me until very recently and I think it is now something I need to work through for myself. For anyone reading this, if you see yourself or someone you know in this story - speak up.",
        "date": "APRIL 18 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was living with my boyfriend, who I felt like didn't find me attractive anymore, and wasn't putting a lot of effort into our relationship. I cheated on him with someone from my work, which is something I regret more than anything. I told the guy from my work that I wasn't ready to do anything sexual. I fell asleep at his house after a long night, and when I woke up, my pants were off and he was fingering me, while grinding up against my side. I told him to stop, and it wasn't until [date omitted to preserve anonymity] that he did. I flipped over and felt myself disassociating, to which he responded \"you feel this upset because you know we are meant to be together. If our relationship didn't mean this much to you, you wouldn't be this upset.\" I stayed with him for 6 more months, and it wasn't until [date omitted to preserve anonymity] in my next relationship that I had realized that it was assault. I am still coming to terms with it.",
        "date": "APRIL 18 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "There is this boy in most of my classes I'll call him L this happened recently and the school hasn't done anything about it and I'm scared he will do it again so he sexually touched me really hard and forcefully once when he was about to leave the class and the second time he has done it was in pe I bent over to get the basketball for him like being nice this was before the other thing happened and he grabbed my hips and humped me I'm really scared of men and boys cause of this so I wanted to share my story cause none of my classmates believe me that he done it and even his best mate said he didn't do it and I'm just so pissed the school isn't doing anything about it.",
        "date": "APRIL 17 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "all boys are influenced by [name omitted to preserve anonymity] and constantly degrade us and make rape jokes on [organisation omitted to preserve anonymity] naming and shaming",
        "date": "APRIL 17 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "This is a long read so if you do choose to read it, thank you. I don’t know if this story counts because I wasn’t physically assaulted but I’ve always been cautious around a certain family member of mine and have recently been told some horrific things about them. When I was about 14 I had an ‘outing’ with said family member that lasted a whole day and we were alone all day. It was about thirty degrees so I was in shorts and a vest top. Not long into the day he started asking me inappropriate questions like ‘have you had sex?’ Then when I said no he listed sexual acts and asked me if i had done any of them. I replied with no to every question of course. He then proceeded to ask me about what sexual things friends my age have done and asking me to go into detail. I replied with ‘I don’t know’ and made it clear i was uncomfortable with the situation but this didn’t stop him. Im putting this on here to raise awareness because this was supposed to be someone I feel safe with. A blood relative who watched me grow for 14 years. A person I used to cuddle and tell them I loved them. That day has been haunting me ever since and I can’t help thinking that if my answer wasn’t no when they asked if I had sex then maybe they would had assaulted me. I told my mum [date omitted to preserve anonymity] because we were going to be seeing this particular person soon. I begged her not to tell my dad in fear of what he would do to them. [date omitted to preserve anonymity] I told my dad. It come out to the whole family in [date omitted to preserve anonymity] and they have not attended any family events since and have been cut off by some family because of it. Although I wasn’t physically assaulted (by this person anyway) it haunts me more than the times I have been. Every time I think about it I feel sick. No one talks about it. No one has addressed it to me at all since it came out, not him or his wife or any of his kids. It’s just life as normal like it never happened. But it did happen and it has traumatised me.",
        "date": "APRIL 16 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "A person that i knew assaulted me quite a few times. Once i was in lesson and they were sat next to me and went inside of my skirt and started touching me. I was too scared to say anything because we were in a full class and to come out and say anything would’ve been weird and embarrassing. There was another time where they started doing something and i said stop but they didn’t, this resulted in me fainting and people not knowing where i was. All in all nothing was done about this despite people knowing and their abuse being exposed by myself.",
        "date": "APRIL 15 2023",
        "location": "ENGLAND"
    },
    {
        "body": "I was raped by a boy a couple years younger than me back in [date omitted to preserve anonymity]. I was in sixth form. It began as consensual but I took away consent and he didn’t listen. My family don’t believe me, and say it’s “not proper rape”. I don’t care if he sees this, I want him to know how much of a disgusting person I think he is. I know you told everybody it was consensual. But was it consensual? When I pleaded, crying and begging for you to stop? When I had to start hitting you? Was it consensual when [date omitted to preserve anonymity] after it happened you came outside of my house and posted pictures of my house on [organisation omitted to preserve anonymity] threatening to kidnap me? There’s a reason I had to go off the till when you came into the store. Because you killed what was left of me as a person those days. I hope you rot.",
        "date": "APRIL 15 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I stayed in student accommodation at this University, I was so excited and happy to finally be out on my own for the first time. I was older than most other people in my accommodation who were mainly 17 and 18 however I thought “this is it! This is the start of the rest of my life”. There I met someone in the accommodation and over the course of the 9 months he repeatedly subjected to me to sexual violence. He wouldn’t listen. I didn’t realise what was happening at the time. It still breaks my heart to this day. No was never an option. I now have to live with the torment I faced there and I have to try and cope with it, deal with it and process it. He’s broken me however I will not be forever broken, I am a survivor, not a victim!",
        "date": "APRIL 15 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "When I was 17 I was assaulted by someone I thought I could trust. He was someone I liked, someone I thought respected me, someone I never expected to treat me the way he did. It’s taken me till now to be able to say the word assault out loud, and to begin to get over the effect he’s had on me. It’s taken me till now to speak about it to someone professional, to tell the story, and attempt to stop the embarrassment I’ve felt ever since. It’s a nasty recovery but I’m so happy I’ve started it. I deserve to get over it.",
        "date": "APRIL 14 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was sexually assaulted in this shithole of a school by some asshole who wanted to make fun of me and try and make a joke out of it. none of the teachers would believe me and tell me i’m a liar. even my guardian didn’t believe me.",
        "date": "APRIL 14 2023",
        "location": "SCOTLAND"
    },
    {
        "body": "In [date omitted to preserve anonymity] I got moved seats next to this really awfully behaved boy to ‘set a good example’ or something. He immediately started bullying me and it got physical regularly. He slapped me round the face and I wasn’t believed because there wasn’t a bruise. In [date omitted to preserve anonymity] I had to sit next to him in a different lesson, again to set a good example. He started showing me and another girl porn. He also groped me a few times. He tried sitting on my lap and falsely accused me of assaulting him because I pushed him off. In [date omitted to preserve anonymity] he airdropped me a photo of his penis in class. I tried telling the teacher at the time and got told off for having my phone out. The boy and his friends kept telling me about how disgusting I was for seeing the photo and how much trouble I would get in. I believed them. I didn’t tell anyone for a year. Midway through [date omitted to preserve anonymity] we had a huge argument that led to me telling on him for everything. By that point it couldn’t be dealt with because it was ‘historic’. He told everyone that I’m a snitch and carried on bullying and harassing me until he got expelled from school for an unrelated reason.",
        "date": "APRIL 14 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was in an after school detention and a boy in my year was shouting sexual things across the room at me. He moved seats and sat next to me and would not leave me alone. It ended with him grabbing my breast, ‘hugging’ me round the chest really hard and squeezing me. There were 3 teachers in the room who didn’t notice. [date omitted to preserve anonymity] he did something similar to me, also in an after school detention. I got blamed for it because the detentions themselves were my fault.",
        "date": "APRIL 14 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "The first time I was assaulted was backstage in a theatre by a co-actor during a theatre camp the summer I turned 15. He was 21. Because of him, I formed an eating disorder right as I was hitting puberty. I would refuse to eat until I couldn't recognize myself until I was no longer the girl he saw and liked so much. I have always wanted to be an actor, and the fact that it was backstage at a theatre was devastating for me. I remember I was learning to drive and once I started driving alone, I would have panic attacks while driving on the freeway because I would see his face in the backseat. I would have to pull over and convince myself he wasn't actually there. It took me most of high school to work through that experience. I finally was getting much better and truly not thinking about him and I felt confident in myself at college, I overcame my eating disorder and I was comfortable in myself. Then, in [date omitted to preserve anonymity], the beginning of my sophomore year of college, I went out to a bar with some of my friends, I wasn't that drunk and my roommate started dancing with this guy. I'm gay and only like women but sometimes it's fun to just fuck around at bars, especially bars that mostly just have straight men and women. So I started dancing with the guy's friend. My roommate and I were dancing next to each other with these guys. And the guy I was dancing with somehow pulled us away from my friends and my roommate and raped me in the corner of the bar. It was so crowded no one could see us, my friends had no clue where I went and I didn't know where they were. I'm not sure how long it lasted, but I was just trying to lock eyes with someone I knew. Finally, one of my friends saw me and pulled me further into the dance floor. I didn't report it because I didn't even know the guy's name, I would not be able to identify him if he was right in front of me. That experience set me into the deepest depression I have ever been in in my life. I was showing signs of alcoholism because of it, coming home every night from classes and drinking half a bottle or a full bottle of wine by myself. I was actively suicidal and almost attempted on two different occasions. But now, [date omitted to preserve anonymity], I finally feel like I am in a good place, I still can't go to that bar but I feel confident in myself, and my sexuality, and I don't feel like it was my fault anymore. And it is still hard because I feel like these things will never go away. And sometimes I wonder what would've happened if I had tried to report it. But I am so proud of myself for how far I've come and I am so proud of the person I've become and how I was able to pick myself back up and try to love living again.",
        "date": "APRIL 14 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "20 girls too 110 boys in my year, every single girl was made to do compulsory self defence lessons because they couldn’t cope with the ammount of police in the school after girls got assaulted continuously",
        "date": "APRIL 14 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "In my 7th and 8th grade years I was raped multiple time by my boyfriend of 2ish years at the time. He was two grades above me. Every time he was drunk and one of the times I was as well. We continued to date for another year and the sexual and physical abuse continued. The last time I became pregnant but shortly after finding out and telling him, we got into a fight and he started hitting and throwing things at me and then hit me in the stomach causing a miscarriage. A [date omitted to preserve anonymity] after this he ended things to get together with another girl. Now i’m in my freshmen year and he goes to my school. [date omitted to preserve anonymity] he came up to me and apologized for everything he’d done but then [date omitted to preserve anonymity] he raped me in the gym at our school.",
        "date": "APRIL 13 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "i was raped and when people found out, his gf and her friend said they were gonna beat me up at school for \"lying\" even though i wasn't. they said all sorts of horrible shit to me like \"no one believes you\" \"no one needs you, not even your mum, that's why she abuses you\" and so instead of going to school the next say i just walked around until the police messaged me so i walked to the police station and said how i got raped and that i didn't want to go to school because the teachers already knew and didn't do anything about it.",
        "date": "APRIL 13 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I have been touched up multiple times by students in busy corridors with having my chest groped purposefully and well as having my butt grabbed more than once.",
        "date": "APRIL 11 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was living and studying abroad and one evening was invited to come out for drinks and a dj set. I didn’t know these people well and felt uncomfortable but I just kept dancing and drinking. At the end one boy and I went to the Metro as we were going in the same direction. On the train, he started touching my thigh, and put his hand under my skirt. I moved away and he became more aggressive until I ran off the train. It was the last train of the evening and I was nowhere near home. Very much drunk, I call a friend that lives nearby if I can stay at his. I offer sex, very much not soberly and in the right frame of mind that when I arrive at his apartment I fall onto the bed and can only see the ceiling spinning. I can’t remember much but him telling me “I’m a good person, I know I’m a really good person”. And then we had sex. Instantly sober again, I felt disgusted, unclean and could only think of how I would have to wait until [date omitted to preserve anonymity] to get the next train home. So I just lay far apart from him, very awake now, in his bed until I could leave. This was one of my closest friends in this new city, so after the incident I really felt like I didn’t have anyone.",
        "date": "APRIL 10 2023",
        "location": "ITALY"
    },
    {
        "body": "One of my friends had told me he liked me beforehand but I didn't want a relationship because we were good friends and we go to a lot of the sporting events together. Over the [date omitted to preserve anonymity] he would keep asking me to go out and I didn't want to. I went to a weekend of training for my sport and he was there and after a really fun first day, I was asked to go for a walk alone with him. I agreed and went off with him to chat. he suddenly started acting really odd with me and put my coat down in front of me to pick up. So obviously I went to get it and when I was bent over to pick it up, he pulled down my trousers. I was wearing underwear but it didn't hide anything so I was completely exposed. I was so upset and mad, I tried to push him away but he didn't move and he pulled me in for a hug from behind and said sorry while laughing. I was beside myself. I told him that he just assaulted me but he didn't seem to acknowledge it. We walked off together and he asked me to give him a chance. I had to then go the whole last day of training just replaying it in my head trying to act normal and as if nothing happened in front of all his friends. I let him off for a while because I didn't know what to do. Only just have I been able to tell him exactly how I feel. He seemed sorry at first but quickly changed the conversation. I want to tell his parents but I am worried it's going to cause so much tension everywhere I go with him.",
        "date": "APRIL 09 2023",
        "location": "ENGLAND"
    },
    {
        "body": "I befriended a boy in year 7 who had a crush on me but I wasn’t Interested. He lost the crush over time and in year 8 he would constantly sexualize me and my friend. He started touching me a lot as a joke and it became a daily thing and in more private areas every time. In his eyes it was a joke but it wasn’t at all. He doesn’t remember it happening.",
        "date": "APRIL 09 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was walking down the hall in school and was assaulted by a [date omitted to preserve anonymity] 11 behind me and maybe some of his friends too (I’m not sure). They were all laughing. It was a hall FULL of people and no one saw and if they did they ignored it. My best friend didn’t believe me.",
        "date": "APRIL 09 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "A boy in the year above me grabbed me where it’s not nice",
        "date": "APRIL 09 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "It was done by one of my friends he grabbed me and pinned me to the wall putting his hand under my skirt the rest I shall leave out",
        "date": "APRIL 09 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was at [location omitted by EI to preserve anonymity] when it happened I was with my friend and we were trying a new obstacle course me and my friend got to the ball pit we sat down to rest and an older boy ran past us . We started to stand up and get out then we saw the boy running down some steps inside the course my friend went one way I went the other I went the way the boy was coming down.he touched me just near my ass nearly getting his hand down mg trousers I told my friend after just because I was to in shock to say anything then he grabbed and slapped my ass I wanted to hurt him but I was just in so much shock we came out of the course and we went over to the trampolines just to see him watching us staring . When I got home I immediately threw up I couldn’t even breathe you might think I was over exaggerating but I still feel sick to this day I want to find him and hurt him but I know I can’t .",
        "date": "APRIL 08 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was in year 8 13yrs old and on the [date omitted to preserve anonymity] I was in drama and the teacher looked away and a boy grabbed me off my seat and placed me on his lap and jumper me up and down on his lap and everyone was just laughing at me and I walked over to my best friend at the time and she looked at me and didn’t say anything and to this day still haven’t told anyone and it’s now the [date omitted to preserve anonymity]",
        "date": "APRIL 06 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "After being assaulted and staying quiet I was told that not telling anyone simply wasn’t good enough and they could have prevented it if I had spoke up no one has done anything about it. My assaulter has not been punished yet I live in fear of them almost everyday at school. This is not the only person that has assaulted me in this school before.",
        "date": "APRIL 06 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "This happened [date omitted to preserve anonymity]. I was walking down the corridor to fith period spanish when I felt a boy touch my ass. It wasn't a grab or a slap, it's kind of hard to explain but he yelled'sorry_' I knew it was deliberate as why would his hand be that low and next to my ass? I was supposed to have a cover teacher but instead I had my head of year who is also my English teacher. I was just in shock I think. I know I should have told her but I was in shock. One of my friends noticed something was up but I didn't say anything. I had dance that night. I went to change in the bathrooms and started to cry. I made sure to not be loud as my dance teacher would easily be able to hear. The first person I told was my best friend the [date omitted to preserve anonymity] on the bus, I just started crying. I felt like I was asking for it even though I now know that I wasn't. That was his choice to do that and what I was wearing played no part in that.",
        "date": "APRIL 05 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "During my maths classes I sat next to a boy who I liked, and I was pretty sure he liked me. But then he started touching my leg and I’d move away, but every lesson it would get worse and he’d have his whole hand up my skirt, I would push him away, ask him to stop and try and move but it didn’t stop him. I requested to move seat and was told no, and one day for dress as you please he came up behind me and grabbed my ass and slapped it, even after I messaged him and asked him to stop he never did. It got the point I’d wear two pairs of tights and shorts under my skirt to try and stop him but it never did.",
        "date": "APRIL 05 2023",
        "location": "ENGLAND"
    },
    {
        "body": "[date omitted to preserve anonymity] was the day I was sexually assaulted by my uncle. It was my [name omitted to preserve anonymity]’s surprise birthday party. Everything was going amazing until my uncle sat next to me on the sofa and held my bum, I didn’t know what to. I can still feel his hand. I get panic attacks and sometimes cut myself because of him. I haven’t really seen him since he touch me because I feel like he would do it again.",
        "date": "APRIL 05 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "This is going to be long, but thank you for reading. I don't even remember how old I was when it started. I think under 9. I don't know if that is a trauma response or if I didn't even consider what happened to be an event worth noting at the time. I loved to play fight, just like I would my cousin. Me and my other cousin, his sister, who is a year younger than me would constantly bombard him on the couch, trying to get him to play with us. He would, but different than the way that I would with my own brothers. Me and my girl cousin would sit on his legs, our signal that we had won the fight. Then, he would tell me to \"sit on his face\". I didn't know what he was saying, what it meant or implied, I just thought it was how I would officially win our so-called battles. I don't know if I will ever forgive myself for following his orders. Sometimes, he would place his hands on his face when I sat, and squeeze my butt. I would say \"ew, you're touching my butt\". \"Eww\" he would repeat, while further digging his boney fingers into my ass. I don't know how many times this happened. A lot. I knew it felt wrong but I didn't know why. I also didn't know why I couldn't sleep in my own room at night, or why I would check behind my door and under any bed a total of 10 times before I could sleep. It wasn't one specific moment when I discovered I was assaulted, but as I got older I gradually realized what happened and I swore I would take it to my grave. [date omitted to preserve anonymity] I told my therapist and some close friends. I was diagnosed with anxiety, OCD, and PTSD. My parents would yell at me for being rude and antisocial at family events (most of which I felt physically sick during). I want to mention that my parents are my two best friends, I told them everything other than this. I didn't want to ruin my moms relationship with her sister (his mom). I felt I would be responsible for our families demise. I was scared of most men. Eventually, I told my parents, they were very understanding and do not make me see him, letting me skip out on some family events. This will forever alter my relationship with sex, and men as a whole. And I live with the knowledge that he will most likely be at my wedding, because he is family and unless I tell my other extended family who I am close to, he can't be the only one I don't invite. I live my life in fear of being raped, because I could barley survive being assaulted. The worst part is, I always feel like I am overreacting and unjustified in the trauma I feel. And this is disgusting, but sometimes I almost wish worse had happened to me so that at least the trauma I feel would match what my mind tries to tell me is worthy of that response. If that makes sense. People tell me to not let it define me, but I don't even know who I would be if it hadn't happened. Thank you for taking your time and reading this. I love you and you are worth so much. You can and will survive what has happened to you.",
        "date": "APRIL 05 2023",
        "location": "VIRGIN ISLANDS (US)"
    },
    {
        "body": "Only recently i’ve learnt about cocsa (which means child on child sa) which made me realise that i was a victim of that. We were only young i say about year 1. At every lunch he would drag me into a secret place in the playground where no one could see, lift up my top, and kiss my stomach. At first i tried to stop him, even ran away from him once but he just got a year 5/6 student to force me to play with him. Of course they didn’t know why i ran away from him and i couldn’t really tell them why so i just dealt with it. I don’t remember for how long it went on for as it was a long time ago but all ik is that the he left the [date omitted to preserve anonymity] so yeah.",
        "date": "APRIL 03 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "Im 13. I know it's not as big of a deal as other things on here, but i've 'dated' two guys. Of course I'm young so not really. One of them kissed my cheek, and there are rumours that we made out a ton and stuff - gross i've never kissed anyone and I cant believe people are saying that. The other one was such a jerk when we broke up, and when I was telling my guy friends about how annoying he was being, they essentially slut shamed me for being asked out by people and said i wouldn't have this problem if I just controlled myself. Seriously. I'm just sick of things like this, and I'm so proud of all of u guys who have spoken up on here so well done xx",
        "date": "APRIL 03 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "i was on my way home from school on the bus, like everyday. i remember standing by the door because it was so crowded. a man got on and stood next to me, kind of pushing himself against me. i was wearing a backpack so i pushed that to the side he was on so there was some sort of barrier between us but it didn’t stop anything. i could see him staring at me through the reflection on my phone. as if i was some sort of object. a few seconds passed of silence and he touched me. he slid his hands behind me and between my legs. he lifted up my skirt and pressed his index finger against me. i froze. i can still remember the feeling of his hands and i can still hear the sound of him chuckling at the fact i was helpless. at the fact i didn’t even try to stop him, i just let it happen because i was too scared. and nobody did anything. there were so many people surrounding us and so many people who saw. what i think about the most is the fact that a woman covered her daughters eyes to stop her from seeing the scars on my thighs. she was more bothered about my self harm than the fact i was being sexually assaulted. everyone could see the tears rolling down my cheeks, but they did nothing. it still hurts and it’s been two months. i still wake up thinking of how it was my fault because that’s what everyone told me. how i was asking for it, but i was in school uniform.",
        "date": "APRIL 01 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I know about 10 sexual assaulters that attend [organisation omitted to preserve anonymity], each one of the stories I know most people in the circle know too, but never has a single one of them lost a friend. I was 14 when I got sexually assaulted by one of them. No one said anything to him although they believed me and I even got called petty for stopping my friendship with him. They make jokes about it as if it’s anything else and excuse it every time. Something needs to be changed in their school culture, not just about rape but also sexism, racism, classism and homophobia. Anyone who goes to a school even partly associated with theirs would say the same.",
        "date": "APRIL 01 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I am now a middle aged woman. A mum with three children. One of whom is 14. One of whom is 11. Both are developing breasts and look so beautiful. I look at my children and try so hard not to see them as targets. I want to talk to them about their growing beauty and self confidence and not feel like I have to warn them not to act certain ways or dress certain ways. But I was once a young and blossoming teenager. And I was on a uni trip. In my first year at uni. We went to a famous landmark in a foreign city. My friend and I met some local boys. We went to their flat. I had sex with one of the three boys. Then they wanted me to have sex with his friends too. Which I didn’t want to. They wanted my friend to. She didn’t want to. Suddenly I felt like the situation had changed. There were three of them and two of us. We were in a strange city, no one knew where we were. It was scary. I felt like if one of us didn’t do what they wanted we were in danger. I was quite sexually active. My friend had only slept with one person ever. I felt scared. For her and me. The situation felt very threatening. We were all in the same room. I was naked. Which in itself was weird in front of my friend. The two other boys brought her in to see what was happening. I have just read about the freeze or friend response. It now explains what happened next. I let them have sex with me. I let them pull me around and use my body. They used me and I just let them. The only thing I didn’t “let them” do was put their penis in my mouth. I said I’d bite it off. But they put it in my vagina and anus. Two of them at once. I felt like a dead weight being spun. pulled and poked and just waiting for it to be over. The trip went home the [date omitted to preserve anonymity] with me included. Thank goodness. Afterwards I had cuts and bruises and scratches. And I went home from uni to my parents and they took to me to a rape centre. I didn’t have HIV or any STIs. I didn’t have counselling. My friend said she had heard me laughing - during the act. I wasn’t laughing out of pleasure I was laughing out of fear. I have spent two decades trying to understand what happened, my part in it, which bits were my fault. What I could have done differently. I am still genuinely proud of my instinct to protect my friend. Because it was a true selfless act. So I must be a good person. But what did those boys think was happening? Did they think I was having fun? I can still remember being limp. Like an unconscious person with my eyes open. Did they think they were raping me? Did they think I was having fun? “You’ve had your fun what about us?” They said at one point. Fun??? It wasn’t fun. It was terrifying. Did I say no? I don’t remember? Did they know we didn’t want to? That it wasn’t what we’d gone with them for? How many other girls did they do this to. They lived right by this monument I feel like they would have done this over and over. My liberated sexual encounter with a stranger in a foreign city had gone from lovely adventure to a confusing assault. And now so much time has passed I’ll never know. This is why I fear for my daughters. I don’t know how to warn them or protect them. How to give them confidence but not over-confidence. I dread the day when one of them comes to me having been assaulted or raped. But I feel like it’s almost inevitable. In my lifetime I’ve been raped, assaulted, groped and spoken to - in a way … like they own our bodies for their amusement. So many times. Haven’t we all.",
        "date": "APRIL 01 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I got raped once and I was finally healing than I got sexual assulted",
        "date": "APRIL 01 2023",
        "location": "VIRGIN ISLANDS (US)"
    },
    {
        "body": "I was sexually assaulted in my first term in [location omitted to preserve anonymity]. I told the uni about it and I was not heard properly. the uni completely dismissed my claim and suspended him for 3 months during the internal look about it but then he was released. after a night out i left my flatmates to go and get food with him and a few other guys before i went back home with them and was chatting to them in my flat’s communal kitchen. i then went to bed and left my room unlocked (as i would as i trusted my flat.) i then was falling asleep while half drunk when he came into my room and into my bed. he then went to my bed and tried to kiss me. i told him stop and he kept saying “i’ve always wanted to do this” and “i know you want it… tell me no if you don’t want it”. i continued to say stop and he continued to the point where he was trying to finger me. eventually i told him to fuck off, still in my drunken state, and he finally left. i then ran to my door, locked it and told the boy i had been very close with about it over phone (waking him up) as i was in his hoodie and i felt so terrible about it. he was the one who then got me to screenshot the next messages he sent me saying “that shouldn’t have happened” “i’m crying can you let me in to apologise” “we shouldn’t have been together”. that last message hit me the most. we weren’t together in the first place. the only reason he was in my flat was because he was having sex with my flatmate the door next to me. she was still awake through this. i sent her the screenshots as soon as i sent them with a message below explaining everything before i then sent it to my whole flat as they all knew him. she then let him sleep in her room [date omitted to preserve anonymity]. she has then continued to see him outside of the flat, not believing a thing i say. i can’t wait to get out of first year and not to live with her. living with a person who hangs out with him all the time kills me. living with another flatmate, a guy, who is living with him [date omitted to preserve anonymity] and again, doesn’t believe a thing i have sent and proven has also hurt me an immense amount. i am very lucky to have the friends around me that i have as my first term has been especially tough. this term has been much worse seeing him hanging out outside in places that i regularly go to has also been extremely hard but my friends have helped me through it.",
        "date": "APRIL 01 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "i was sexually assaulted for months at this school. The guy was supposedly gay and i didnt think anything of it. we were in [date omitted to preserve anonymity] so i knew that what he was doing was wrong i just wasnt sure what to do. i told myself that because he was gay maybe he acted wierd to other girls? Im not sure ive never had a gay friend. It started off with hugs, then turned into grabbing my boobs and slapping my butt. i was in a friendship group with all boys so they all though i was a pussy if i was to tell anyone about it. it kept getting worse and worse. He did it to plenty of other girls too, about three or four? But not to the extent of what he did to me. I felt like i didnt have a voice as i know my schools history of mental health problems and sa. He was in most of my classes and that made me feel very uncomfortable and i skipped school alot and faked being sick just because i wouldnt have to see him. I went into my photography class and he decided to join my group. it was okay for about 10 mins but then he sat under the table and was pretending to be on his phone even though it was obvious he was taking pictures up my skirt. I crossed my legs and was contemplating saying something but im too socially anxious for that, he then got up and sat extremely close to me and rested his head on my shoulder. He then proceeded to put my hand on my thigh and proceeded to go higher and higher, nobody was there to witness it and i felt like if i was to tell anyone nobody would believe me. He put his hand up my skirt and was pulling it up, thats when i decided to take photos of him doing this whilst he was on his phone. i tried to tell my friends but as i thought none of them believed me and even when i showed them the photos they thought i was just over exaggerating. I told my mum [date omitted to preserve anonymity] it happened. she immediately contacted the school and we had a meeting. i wasnt in school for weeks because i have anxiety of going to school now because of that. it took the school about 2 days to actually have a meeting with me. I hated seeing him do it to other girls to so i knew i had to do something. we had the meeting and the first thing the person said is who is it and when? it had been going on for months but i only just bulit up the courage to say something. i showed her the photos and said that they will have a meeting with him asap. it wasnt asap he was in my classes and didnt have a meeting until [date omitted to preserve anonymity] which i think is absolutely disgusting!!!!! i was told that he denied everything he was accused of even though we had evidence. His parents didnt do anything to punish him and just blamed it on him being gay. the school said that there isnt much they can do atm and i was so mad. it took them 2 weeks to get him out of all of his classes and he had another meeting about how sa is wrong? isnt that common sense! He got excluded from my school about a month or two after reporting it. not suspended for the time being so they can wait for the paperwork to go through so he can be excluded. I had to see him everyday even after everything. My school is absolutely awful at dealing with sa and mental health. They need to get it sorted, because i dont want anything to happen to any other girl because the constant fear to even sit next to a man, i am traumatized by it and its still [date omitted to preserve anonymity]. Couldve been resolved so easily if the school dealt with it better. Appauling. My school is a horrible school and dont even bother going to any of them for any of your problems.",
        "date": "MARCH 31 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was in [location omitted to preserve anonymity] and was doing an art activity in a hall. I went to use the bathroom but used the P6 and [organisation omitted to preserve anonymity] toilet instead as it was closer and I wanted to feel more grown up using the older kids bathroom. I went into the cloakroom to get the the bathroom and I was shoved in my back into the bathroom. It was a P7 boy who I was terrified of. He was a really well known bully and was violent. I always avoided him and his friend group, often taking a longer walk to avoid him. He pulled down my skirt and tights and raped me. It only lasted for a few seconds and I didn’t know what was happening as I hadn’t had a sex education class. I just knew it was wrong. It all happened so quickly. I remember feeling embarrassed that he had seen my bum. I did not tell anyone as I didn’t even know what happened. I also knew my mum would make it a big deal and I didn’t want that. I ended up going to the same high school as him and he was a bully there too. Shame that two schools did nothing about someone who made so many others lives a misery.",
        "date": "MARCH 31 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "i was sexually assaulted many times in that school but was scared to report it cause they wouldn’t do anything.",
        "date": "MARCH 31 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "im young and was with a guy friend who i didn’t have an attraction for at all and thought he was only just a friend. i met him and his friends and wanted to have a cigarette so we went to his house just me and him, it was fine but he was being really weird to me which made me uncomfy as he was looking at me and talking random nonsense. we had a cigarette and went back to his friend which lived down the road, we talked until i wanted to have another cigarette so we went back to his house and i wasn’t able to roll the cigarette so he said “if you want me to roll the fag and give it to you, just come to the living room if you really want it” and my dumb self didn’t think anything of it so we went into the living room and that’s when things started to get weirder n i felt more uncomfortable. he told me to sit on the couch with him so i did, he was looking at me in a weird way, then he asked me how attractive did i think he was out of 10. i thought it was a really weird question to ask and i lied calling him a 7 but for me he was below that. he said if i wanted the cigarette i’d have to sit on top of him. i started to feel uncomfortable and didn’t want to but i got pressured into it. he told me to sit on his lap but facing towards him so he could see my face and it was awkward and i wanted to go. i told him many times i didn’t want to and he was nagging me to do it and that he does it to his other friends so it’s not a big deal but to me it was. somehow after that he got me to lay with him on the couch and was spooning me, i felt his dick near me which i hated so much. i was so uncomfy that i tried to leave but he was nagging me to just stay where i was although i was in such an uncomfy position and didn’t like it at all. all i wanted was to leave and it felt like a long time as i constantly said to him i didn’t want to do any of that but he was ignoring it and started holding onto me so i couldn’t leave when i tried. after a while he finally let me leave as i constantly kept asking and i’m grateful it was nothing more and worse from that. i’ve never felt so uncomfortable and disgusted. on my way home i cried and my parents wondered where i was because i was late home but the only reason i was, was because of him. i cant explain the feeling especially that he didn’t understand i was uncomfortable. to this day sometimes i see his face in a different person i see in school and reminds me of him. i saw him [date omitted to preserve anonymity] walking past me and haven’t seen him since the situation, my heart dropped and i tried not to cry. i was on my way home and i called my sister to tell her that i saw him whilst balling my eyes out because i couldn’t hold it in anymore. when i got home i cried in the bathroom and gave me flashbacks to what happened, even now thinking about it. i just wish some people knew boundaries.",
        "date": "MARCH 30 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "i was touched by someone who I called my best friend when I was 14. He grabbed my butt and started squeezing it. it made me very uncomfortable. I got an erection so he grabbed that too. I felt disgusted and used.",
        "date": "MARCH 30 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "the boy next to me kept touching my leg and i told him to stop. i got a detention for talking.",
        "date": "MARCH 30 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "In middle school I was extremely close with a lot of people, my friendship group was around about 10-15 people. Me and another person, I’ll call them X had feelings for each other and began dating. We were close, not overly affectionate since I wasn’t and still am not the most comfortable with physical contact. However, at breaks and lunch she would start to sit behind me when i was on the floor and lean on my shoulder, I didn’t mind that. However as we dated for longer she would start stroking my back or further down my hips, front and back. I had said I wasn’t the most comfortable however she still did those kinds of things to me. Even once X and I had broken up, she continued to do those kinds of things and eventhough I had said to her before that I didn’t like it and especially now we had broken up, it almost seemed like she deliberately ignored it. I’m no longer friends with her or the rest of that friendship group and hope to keep it that way.",
        "date": "MARCH 30 2023",
        "location": "ENGLAND"
    },
    {
        "body": "I was sexually assaulted by a friend I had known for a few weeks. He came over to my dorm and was being very forward with his sexual advances and eventually I gave in because I was scared to resist as I have been assaulted in the past which he knew. After that he was under the impression that we were a thing which I didn’t feed into. He kissed me in the stairwell one day and then shoved his hands in my pants and tried to finger me. He did the same thing to me in a storage room [date omitted to preserve anonymity]. If confronted him and he ignored what I said and instead focused on how I led him on and didn’t tell him I didn’t want anything serious. He will never admit to what he did and he betrayed me",
        "date": "MARCH 30 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "A boy most people adored often would make sly jibes at many girls. There's a community within a department of our school in which he was loved by the teachers and many other students, and people outside of this community generally find him lovely. A lot of the things he's said and done are weird. My friend spoke to him once and he randomly popped up with \"I sleep naked at night so I can rape you.\" Out of nowhere. More recently, it's surfaced that he's sent numerous girls in the department unsolicited nude photos of himself, while dating a member of that department. He doesn't show his face anymore, now that everyone knows. The school hasn't done anything about it, despite there being proof of everything he's done and said.",
        "date": "MARCH 29 2023",
        "location": "ENGLAND"
    },
    {
        "body": "In my second year of high school i was in a design and technology class and we were putting away the rulers. Then a boy i had been friends with for a few months slapped my arse with a ruler. people saw and laughed and i wanted to cry. Then the [date omitted to preserve anonymity] in another class i tried to confide in my spanish teacher and she said ‘what doesn’t happen my class isn’t my problem’. My heart dropped and i never told anyone again. My mum didn’t even try to comfort me and i gave up trying to tell anyone how i felt and what happened to me.",
        "date": "MARCH 29 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "During my first year of university i went on a night out with my mates. I met a guy and we talked and made out and he offered to buy me a drink. when we were at the bar he was rubbing himself on me which made me feel dirty but i was too drunk to say anything because i’m a naturally shy person. We went to sit with my friends (I didn’t ask him to sit with us he was following me). When we were sat he kept trying to put his hands between my legs and made me put my hand on his penis over his jeans and used his own hands to move mine. One of my guy friends noticed and got him to go away. As we were leaving the club he saw me again and grabbed my waist and tried to get me to leave with him. I kept telling him no i need to go with my friend and he followed me out of the club. The bouncers noticed and stayed with us until he walked away completely. I remember being so scared that he was following us back to my flat. (he wasn’t which was good). Every time i went back to that club i have panic attacks and eventually stopped going because of it. I went to a different club [date omitted to preserve anonymity] and he was there. I stopped going clubbing all together after that. Ever since i’ve struggled more with social anxiety and depression. I know it’s not my fault but it feels like i should’ve done more to stop it. My friends kept telling me that i was too drunk and could barely talk to them and he could see that too.",
        "date": "MARCH 29 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "A list of things said by teachers at The [organisation omitted to preserve anonymity] for girls - my whole class were [date omitted to preserve anonymity] about to go on a school trip to [location omitted to preserve anonymity] and were told we couldnt wear red lipstick because it was too seductive - again we were [date omitted to preserve anonymity] and told by a male teacher that our skirts were too short and would distract men and invite them to look at us (the only men we were around being teachers) - our headteacher who preaches feminism caught himself before saying our over the knee socks made us look like hookers - my drama teacher told a class in year 10 that their socks and skirts made them look like girls from anime porn",
        "date": "MARCH 29 2023",
        "location": "ENGLAND"
    },
    {
        "body": "in [location omitted to preserve anonymity] upper school my boobs and ass were groped by someone called [name omitted to preserve anonymity]. i wont stay quiet",
        "date": "MARCH 28 2023",
        "location": "ENGLAND"
    },
    {
        "body": "i was in year 7 and 8 with my boyfriend at the time this happened on more than ken occasion he used to make me spend every break and lunch time with him away from my friends and any time someone came up to us i wasn’t allowed to speak i was pushed up against the wall while i was forced to hold my coat covering my hips while he attempted to do things to me this also happened on the school bus where i had to put my coat over my lap whilst he would do things to me he also forced my hand onto his p***s and made me get him off on the school bus he would grab my wrist and slam it into the wall if i didn’t do what he said i never talked about it as he was popular and i wasn’t",
        "date": "MARCH 28 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was raped several times in my sleep by the person who was at that time my boyfriend. I would wake up and find that he was in the middle of having sex with me. When I woke, I froze, and was unable to do anything to stop him. After that, I would just go back to sleep instead of processing what had just happened. Because of this, I suffer from PTSD surrounding sleeping, and for a while I couldn’t sleep in a room or bed with others without it triggering an attack.",
        "date": "MARCH 28 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I invited my good friend to visit me in [location omitted to preserve anonymity] for a hiking experience. He had come along to a few hikes in the [location omitted to preserve anonymity] with me, and was really trying to get back into hiking and fitness, so I had encouraged him to do so and he became my regular gym buddy and was invited to pretty much all the hikes I went on. I'd been alone in [location omitted to preserve anonymity] up until he and two other friends flew out, so I was so happy to have company. Because of this, almost definitely took things a bit too far [date omitted to preserve anonymity], and became black out drunk. I don't remember the incident very clearly, but I remember distinctly opening my eyes and feeling things and seeing my friend in front of me. I laughed at first. He was a gay man and I thought it was silly because I am a straight man. Until I realised I was on the toilet, with my pants down by my ankles. I was coming back and forth from being coherent and with it, his tongue was in my mouth and his hands were places they shouldn't be. I repeatedly said no. I repeatedly said stop it. I pushed him off me but I only have two hands, I could push his head and both his hands off me at once. I remember trying to pull my pants up, and standing up, and he pushed me against the wall and again, attacked me. He whispered disgusting things to me like \"come on\" \"please\" and then I blacked out again. I packed my bags that night and got a £200 taxi to the airport with one of my other friends who were there and spent my savings on the next flight. He texted me the [date omitted to preserve anonymity], asking if he was going to jail, but persisted that he didn't remember. Asked me to walk him through what happened, probably to know what I remembered. I don't know if he raped me. My sti check came back negative, but I will always have that question mark. He went out partying [date omitted to preserve anonymity], and I saw him on all my friends Instagram.",
        "date": "MARCH 28 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I attend [organisation omitted to preserve anonymity]. I choose to report my rapist to the [organisation omitted to preserve anonymity] university. They found enough evidence to take it further and although in their guidelines they said they would not allow someone who is a threat to the reportee or others on to campus during the investigation. They refused to ban him from campus even though he raped, sexually assaulted me multiple times and physically abused me. Eventually the disciplinary meeting happened after it being pushed back 2 times. They allowed his lawyer to victim blame me with no repercussions and no one stopped him at all. He was eventually found guilty, and i had to wait another month for him to receive his punishment, so that he could have time to try to prepare some reasoning to not be kicked out the uni. If the uni have found it proven that he raped someone, they should be kicked out on the spot. There is absolutely nothing he could say to defend himself as it is inexcusable. they refused to let him hear my victim impact statement after i had requested they would multiple times. It seemed like they were trying to protect him throughout especially since he hired a lawyer. I was forced to keep the whole thing confidential the whole time and threatened that they would drop the case if i told people which meant i had to see mutual friends carry on being friends with him. Even now that he has been kicked out the uni and banned from all uni premises i am supposed to keep my experience confidential which has no reasoning at all and is just them trying to silence survivors which is disgusting. They are so scared for people to find out this still happens given the bad reputation [organisation omitted to preserve anonymity] has. Things they have created to ‘combat’ it are just for show. They created a noodle values course that teaches you about consent among other things. He didn’t complete it either year he was there. If you don’t complete it you are not meant to have access to any online [organisation omitted to preserve anonymity] platforms which i believe means noodle [organisation omitted to preserve anonymity] etc. Yet he didn’t complete it and had access to everything and there were no repercussions to it. He would have learnt about consent which possibly could have stopped me from being raped if the uni had just bothered to chase him up on the course as they should have given it was ‘mandatory’. We put in a formal complaint to the uni and haven’t heard anything and it has been around 3 months.",
        "date": "MARCH 28 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was 13 years old when this happened, a month into joining a new school when I was raped. I was getting changed, for my PE lesson in my study room, that I shared with another boy we'll call him x, when x booted the door open as he usually did but this time instead of sitting down on his desk, he pushed me to the floor. Lying on my chest unable to move he pulled off my underwear as he undid his belt and slightly pushed down his pants. X then continued to have gay sex with no time for me to consent. He came in closer to whisper in my ear, “If your gay then why aren’t you enjoying this.” He then continued until he finished, and I started crying. After he had gay sex with me, he held me stroking my hair as I continued to cry, this tortured me I never felt able to speak out about it because he made me feel safe in a way. It ruined my relationships because it almost felt out of love he did what he did. After a while he stopped holding me, he got changed and left. After he left, I got changed, covered in bruises and a crushing pain in my ribs I left for my PE lesson. The day after, he threatened to kill me if I spoke out & he went on to rape and assault many people. I blame myself for what happened to them every day. Others spoke out I did not, the school does their best to cover up what happened to us. They have a reputation to protect as this is extremely important for them as they are a private school. I then went on to self-harm almost every night. With a couple of suicide attempts along with it. Then two and a half years after the first incident when I was 15. The same boy beat me up in front of a group of people for no reason, aware to me. I told a friend about this incident who had been hurt sexually by [name omitted to preserve anonymity] I was called into the safeguarding lead’s office, she had built a reputation for covering shit up, where I was forced to tell her what happened about the second incident. Now I am still haunted by him. Scared for my life. Scared to be who I am, as someone who is pansexual who is non-binary because of what this boy did to me. I am angry and yet disappointed in myself for not being able to speak.",
        "date": "MARCH 28 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "When I was in first year of University, I kissed a guy on a night out in the students union. When I left to go home he kept asking to come with me and I said no, but he followed me and my friends back to our flat. I refused to let him in and left him outside. [date omitted to preserve anonymity] he got into the building and someone let him into the flat, which really annoyed me. He would not leave me alone or take no for an answer. I wouldn't let him in my bedroom but he kept picking me up/pinning me to the sofa and trying to touch me and calling me a prude or whatever. He was really, really strong and I actually could not physically push him off which was pretty scary and I can still remember the panic even though it was [date omitted to preserve anonymity]. Don't remember how, but I did manage to make him stop and he did leave but it has always stuck with me. The worst thing was my flatmates were aware of what was happening and did nothing to stop it or help. I bumped into him at a later date and realised he had given me a fake name which I also thought was just weird and creepy and added to him being an all-round not great person.",
        "date": "MARCH 27 2023",
        "location": "SCOTLAND"
    },
    {
        "body": "When I was [date omitted to preserve anonymity] , my mum and dad were split up so every two weekends I would go round to my dad’s house where he lived with his wife and her son . It was that long ago and I was that young that now I hardly remember any good , funny memories with my dad’s family . But every day , I get constant flashbacks ( not PTSD ) to the times when me and my then stepbrother would have finished dinner and I would run upstairs as quick as I could and hide behind my curtains above my bed from him . I never understood how he kept finding me but it was because it was my ONLY hiding spot . It sounds like a normal harmless game of Hide and Seek but it really wasn’t . I never ran laughing . I never ran while he counted . I ran to get away from him so he wouldn’t force me to do stuff I didn’t like . I ran because I knew I would feel pressured into doing it as I was young and never knew I could say no . Once he ‘ found ‘ me , he would say roundabouts , “ Come on , it’s only for a second . I’ll do it back to you once you’ve done it ! “ I would then imply , with my reasoning above , and he would force me to kiss him wherever he asked and there was one spot he enjoyed me kissing the most . Very obvious where it was . I hated it . I didn’t even know it was and what it was called . But all this happened every day I was round wherever he could find a good hiding spot whether that was after dinner , in my little play tent , in my parents bed or anywhere else . It still haunts me [date omitted to preserve anonymity] because no one else knows ; not even my own dad and I trust and love him more than anything , nor my boyfriend who has stuck with me through everything . There were multiple other times when I was young including when I was 11 when I went to the cinema with my Auntie and she left me with a friend , a boy , a few years older who wouldn’t stop stroking my face even when I said no so I went out to my Auntie and told her I hated the film then after many months building up the hatred , terror and courage I told my mum and now I never see that boy anymore . I was also 13 roundabout when my dad had a different girlfriend who had two sons ; one bratty 12 year old and a slobbery but cute 3 year old . I only got on with the younger one as I would have constant arguments over unnecessary stuff with the older one but one day when me and the older brother were play fighting in the bunk bed he flipped me , pinned me and sat on top of me . I could feel him attempting to dry hump me while I was still stuck but I wriggled out and he pretended like nothing happened , probably hoping I didn’t notice but I did and I couldn’t sleep that night . [date omitted to preserve anonymity] from now , I had a year long boyfriend and I thought he was amazing at the time but slowly he started to show his true dark colours where he would mentally , sexually and emotionally abuse me . He would constantly want to do sexual acts like play with me or me ‘ help ‘ him finish and if I was ever not in the mood he would get angry and then get upset with me to which I felt like I had to comply with him because his excuse was we cuddle all the time and we never do what I want or if I genuinely never gave in he would suggest and start watching porn because he assumed it would turn me on every time and it never did but I wanted him to shut up so I would ‘ help ‘ him . One time we were messing around and he attempted to try and start fingering me even though he never asked or told me he was going to and I started telling him I didn’t want that and he was trying to convince me it would be okay and that it wouldn’t harm anyone so he carried on thinking I was find with it then . I then started crying because the forcefulness and the words coming out of his mouth felt familiar but he didn’t care and he started getting angry again and ignoring me while blaming me telling me I didn’t say I didn’t want it . Online harassment is also a thing . I have also experienced this where who I thought was an alright mate asked me for nudes and I would get something in return . I never sent him nudes but I sent something suggest full where I was lying in bed but he kept asking for more but I told him there was no more than that . Even though I sent him the picture and it was kind of my fault I still felt peer pressured and horrible afterwards so I told my friend and he was completely on my side . I am telling you , rape is not always sexual assault / harassment . Blackmailing , guilt tripping , forcing are also slight examples of sexual assault . Do not be afraid to tell anyone or it will stick with you forever . Do not be afraid to say no and stick to no or it could lead to significant mental issues . Having someone by your side is not always a bad thing . They can help and stick by you . Even if you were slightly in the wrong , someone by your side is always mentally helpful .",
        "date": "MARCH 26 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "Hi I’m [name omitted to preserve anonymity] I’m [date omitted to preserve anonymity] on [date omitted to preserve anonymity] I was sexually assaulted by a lad who was in my friend group it was late at night I was staying at my friends house at the time and me two girls and this lad was staying in this room as my friend had her own room the two girls left the room to speak to my other friend which is when the lad stuck his hands down my pants and started to mess with my penis I took his hands out and told him to stop he forced his hand back down my pants into my underwear and I tried to get them out but he wouldn’t move it wasn’t until my two other friends was coming back that he took his hands out I felt ashamed about what happened so I didn’t tell anyone for a while I eventually told some people and word got out and the lad dm me asking me why I would accuse him of that and that he never sexually assaulted me it was joke all lads do it even though he knew I didn’t like it and that told him to stop just be careful guys",
        "date": "MARCH 26 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was at a family friends party and on facetime to my boyfriend outside and a boy slapped and grabbed my bum and then was making sexual jokes and comments about me all night",
        "date": "MARCH 26 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I don't know if this really counts but a boy at school had been touching me and hugging me and making me uncomfortable for literal months but I didn't know how to say no because he had asked me out before that and I said no and he got really upset. A [date omitted to preserve anonymity] he decided to take it a step further and put his hand on my leg under the desk. He then tried to grab my boob later in the lesson saying he was finding a pressure point. I didn't report him cause I felt like it was my fault for not saying no but then the next lesson he started stroking my bum whenever he walked past me and my friend made me tell a teacher who made me tell safeguarding. Nothing was done about it for a week so I told the teacher that nothing had been done and now he's trying to deal with it himself. I really struggle with feeling guilty about it and like I did the wrong thing and that in a way he had a right to do that cause I never said no even tho i know he didn't have a right. Also I feel even worse cause before all this happened he was my friend so I'm grieving the end of that friendship at the same time as coming to grips with what happend and that I shouldn't want to be his friend and that he was probably manipulating me the whole time anyways",
        "date": "MARCH 26 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was about 6 or 7 at the time. I was living in [location omitted to preserve anonymity], and primarily stayed with my uncle and aunt as my parents worked a lot. One night, I went to the bathroom, and my uncle followed me in the bathroom. He told me it was normal, and that everyone did it. I didn’t know any better, and some of the things he did felt good, so I thought it really was okay. My aunt found out and immediately asked me questions, blaming me. She said I wanted it, and that it was my fault he had done it. She never broke up with him, and soon after my grandfather started doing it too. My aunt knew, and never told my parents and constantly put me down, putting the blame on me, calling me, a 6 year old at the time, a slut. To this day, I haven’t ever told my parents. I’m afraid it will break up the family, and nobody will believe me.",
        "date": "MARCH 25 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "A classmate of mine touched my backside whilst we were working on our school production. As I try to speak about this, the person says that it is a rumour but I think \"she\" wants to get away with it because they see themselves as transgender. They have also drawn penises on pieces of paper and showing them to me asking me if I liked it but as I say no to this, they call me gay for it. They have also told their trans friend and said that I can't say this because it is serious even though I'm trying to speak up about sexual harassment. Their friends are trying to make them seem better than me and be on their side for this. This has started [date omitted to preserve anonymity].",
        "date": "MARCH 25 2023",
        "location": "ENGLAND"
    },
    {
        "body": "I was only 11 when a boy in my class came up to me and decided to touch my bum. when he did it, he said “nobody’s touching that now.” I never knew what he meant, but now it makes me uncomfortable every time i think about it.",
        "date": "MARCH 25 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "Man where do I start. In [date omitted to preserve anonymity] [date omitted to preserve anonymity] cooking class, a boy in my class grabbed my bum. I was only trying to get a spoon. His girlfriend then burst into laughter and that’s when I found out it was a dare. I felt so violated, it felt like I was naked in-front of the whole school, I felt ashamed and embarrassed. I didn’t tell any teacher, I didn’t know where to start or what to say, or what they would do. I didn’t even know if there was anything to be done I instead kept my mouth shut. I later found out the same person (in year [date omitted to preserve anonymity]) also violated my friend. As she was handing out books she leaned over his desk, and that’s when he took the opportunity to grope her boob, this time he was caught by a teacher as she was luckily watching, he was then punished. After my GCSEs I went to a sixth form. It was a very tight knit school and I felt like I didn’t fit in. In [date omitted to preserve anonymity] I found out a guy I liked was interested in me and I perused the relationship, it felt nice to be recognised and accepted. Though after we broke up, on a second glance I realised the relationship was sour. He had taken advantage of me. I felt manipulated and used. I had come out of the hospital high on anaesthetic from my procedure. I wanted him to be with me and he obliged coming to my house. There we laughed and joked about how high and out of it I was, he commented on how my pupils were huge. We then went to my room and cuddled nothing new, but as it does it progressed and he was trying to penetrate me. I learnt that I couldn’t have consented because of my state, I felt violated and used, really upset. I felt let down, we had discussed the consequences of my anaesthetic, how I couldn’t consent to anything legal because I want sober. consent is often mentioned in school, but only the stereotypical examples of no means no, never that someone who isn’t sober can’t consent, I felt let down. Later after our break up - which was for other reasons, I discovered before we were a couple he asked his sexualised me behind my back, asking his friends if they would “fuck that” when I was out of earshot. Who knows what else they discussed. This particularly is the most difficult part, I struggle to trust people when they mention the talk about me with friends. I don’t know what else he said, what else they discussed and what they know about me that I thought was private and confidential. He violated me in so many ways but most of all my trust. It’s hard knowing someone who was so kind and loving was in private so horrible and destructive. I was going through a lot at the time and he would often comment on how strong I was, how I was the strongest person he knows and how he was proud of me. I’ve never told my mum that I’ve been raped I don’t know how to, it feels too private. There is so much more to this situation, but these are the essential, bare bones parts. To who ever reads this, you are strong and I am proud of you, don’t let what they did define you. You are more than that. In time you will heal and grow but until then talk to people, always always talk. If not a teacher or parent, talk to your trusted friends xxx",
        "date": "MARCH 24 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "At school the toilets are unisex. This guy told me to come into the cubicle with him. I agreed as we were mates and I thought he just wanted to vape together. When I’m there he locked the door and approached me. I asked what he was doing. He then continued to say that I needed to stop playing with him and slipped his hand under my shirt and grabbed my tit. I told him to stop and he didn’t listen. I then pushed him away and he got the other side of the cubicle. He was then really mad and slapped and purposely hit my tit. He then laughed and left the cubicle. Since then he told people how I was “begging for him” and how much of a slut I am.",
        "date": "MARCH 24 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "Every day I walk through this college and I don’t feel safe. I can’t feel comfortable. I look around wherever I walk. Because he goes here. I thought I had left him in my past but then he joined my college. He was my boyfriend at the time and I was 13-14 and he knew I was young and innocent. He took that away from me when he sexually assaulted me twice in the same day. I broke up with him but he then threatened to harm himself if I didn’t get back together with him. He manipulated me and told me he loved me so I came back. He then controlled me with everything I did and said and where I went. I thought when I broke up with him for that final time I would never have to see him again. But I do. I have told college that I wish to try and avoid him but cannot bring myself to tell them why. I never reported this to the police as he has told everyone we know that I am a liar and made up the story to make him look bad. He has threatened me and has told me that it was all a dream and he never even touched me. He knows, I know and anyone who I know knows exactly what he did to me and the damage I have been left with because of it. I want everyone to know (including his girlfriend) that he is a horrible man.",
        "date": "MARCH 23 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I used to share a bedroom with my brother when I was younger and when I was 7 years old my brother took my virginity from me. I've blocked some of it out over time but I remember him trying to get me to lick his genitals. I don't think he remembers what he did. I started wetting the bed well into high school. I used to peck out my eyelashes in primary and I progressed to cutting in high school.",
        "date": "MARCH 22 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "Hi there, I was recently sexually assaulted by a boy a few [date omitted to preserve anonymity]s below me. I am in year 13 and he came up to me and squeezed my bum randomly. I have no connection to this boy and had never spoken to him. I am a sixth former and obviously any sexual assault is awful and devastating but it was even more humiliating and baffling to me that a person of such a younger age had the confidence to do that to someone. I believe change needs to happen and admire your mission so thought I’d share.",
        "date": "MARCH 22 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was in a relationship with him for 2 and a half years. It was about a year into our relationship that he assaulted me for the first time. We were laughing and kissing and then he suddenly pushed me onto the bed, pinned my hands behind my back and started touching me through my underwear. I kind of just froze, I went still and let myself dissociate and as he was doing it he said \"I can't tell if you've stopped moving because you want it or because you've given up\". I hear those words in my head multiple times a day, horrible, degrading, humiliating words. The second time I'd just come out of the shower, I laid down on my bed because I was dizzy from how hot the water had been and he laid down next to me and pushed my towel down to start groping my chest, I told him to stop, said no multiple times even going as far as to say \"no, I don't want that\" but he didn't stop, just slapped my hands away and kept groping me. I stayed with him after all that. I let him cheat on me, manipulate me, guilt trip me and mentally drain me. My breaking point was when he raped my other boyfriend (it was a polyamorous relationship), after I found out what he'd done I broke up with him and shortly after found out he'd also sexually abused the person he cheated on me with. Me, my boyfriend and his other victim reported him to our youth group and got him kicked out of it, but all my friends from the youth group have taken his side, keep referring to what he's done as a \"mistake\" and a \"misunderstanding\". I feel so betrayed and empty all the time now, I want to be high or drunk or just anything but sober all the time. The most fucked up thing about it to me is that I don't want to talk about it, I rehearse what happened in my head all the time but the idea of talking about It any more than I have is so scary, because as long as I keep it to myself it can't get twisted, it stays my story and nobody else can force their opinion on what he did on me.",
        "date": "MARCH 21 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "well, I gee i have read so many things....i thought it was uncommon, but it is not........ I was nine ([date omitted to preserve anonymity]) at a friends party, in a lovely flowered summer dress, i loved that dress. her older brother asked me to help him with some drinks, he was so nice a few times we meet. I went into house and down the stairs to lower floor type basement. He pushed me aginst the wall and said he like me a lot, i smiled, he kissed me on my mouth, lots, i tried to push free, i think he was 15 then, yes 15. next his hand run up my leg to my knickers. he smiled and said you like that or something like that.. i was just panic and said nothing. he knelt down and pulled my knickers down, lifting my dress up as he got up, he unzipped himself, but i was just frozen, i remember feeling it aginst my tummy and trying to go between my legs but then he said shit im coming and next i was on my knees and he put it in my mouth and held my head still. it was horrid. as he pulled it out it went down the front of my dress a bit. he stood me up and said we were now good friends forever, he took me over to the sink and wiped off marks on dress, then stood behind me and i felt it again on my bare bum. then someone called out my name, he moved away pulling his pants up. pick up my knickers and gave them and said put them on and say nothing and left. i stay for a minute or so, put my knickers on and went up. and said nothing. oh i wish i had. [date omitted to preserve anonymity] he waited near the school gate, followed me, grabbed my hand and pulled me into the tree area. some thing happen no knickers off, but after a min or so rubbing aginst me, i had to put it in my mouth. after a few more of these happenings, he gave me a ring, i thought we would be married one day. full sex just after xmas at his room i was [date omitted to preserve anonymity] and a bit, Firework night just before my birthday, he bent me over a chair and put inside me, you knew where by [date omitted to preserve anonymity] onwards he always wanted me to lie on my front and lay on me, or you know in my mouth, maybe as i cried sometimes. at [date omitted to preserve anonymity] it stopped. he had gone into the navy at [date omitted to preserve anonymity], next time i see him [date omitted to preserve anonymity] , he never spoke a word, with his new 15 yo girlfriend.. i dont mix with boys, i dont want to i am 17.5 now. please please tell someone. oh that dress, i never worn it again and burned it at [date omitted to preserve anonymity]. but he like the schoolgirl look of white socks and knickers anyway. sorry i did enjoy some on it and the gifts and cider. and i hate myself for that.....",
        "date": "MARCH 21 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "when i was around 7 years old my brothers friends would come over, although they where only 4 years older than me i still remember one. He would come into my room when having sleepovers with my brother, i had hardly learnt to speak english when he would undress me and lie next to me in bed, making me hold his penis. I came from a catholic family and the idea of telling anyone what i thought i had done disgusted me more than the idea that i had done nothing. When I was 13 he came into a bathroom after me, we were having a family barbecue, he locked the door and he raped me. I told nobody, and even when i tell people [date omitted to preserve anonymity] I say he assaulted me instead of raping me. I dont know how to grow from it and im unable to say no to men.",
        "date": "MARCH 21 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was sexually assaulted in my school for 5 years non-stop and no one believed me. I was told by the boy that my NO to him meant nothing. That it meant nothing to him. He would always touch me in sexual ways, make sexual comments. When i would try to stop him from touching me he would hit me or kick me. This went on for years, i suffered in silence. Only recently have i had justice served and had help from my loved ones.",
        "date": "MARCH 20 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I had spent ages revising, and wanted to have a break and go out with my friend and have some fun. She was a year older than me and we went to the cliffs and had a picnic. She asked if she could invite this boy and his friend and asked them if they could give us a lift to this fast food place. I was excited because i hadn’t really bothered with boys that much. When they got there the older girl and boy went off and they left me with this other boy who was apparently drunk but had literally had a few sips of prosecco. He kept trying to make me drink it by taking a sip and pulling me towards him to drink it from his mouth. ew. Then he started to slide his hands up my thighs and i initially ignored it and scrolled on my phone but then i started to freeze and when the others had officially left he pulled me closer and started to kiss me and slide his hands under my dress. I just froze and tried to go along with it bcos i didnt know what else to do. I even offered to do something to him bcos i hated what he was doing to me. He kept trying to choke me and only after he did it did he ask ‘if that was okay’.",
        "date": "MARCH 20 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "We were in science and queuing up to get a bunsen burner, the boy behind me grabbed my bum and squeezed it. I turned around and him and his friends were laughing. I told my teacher and he just said they were messing around and didn’t mean any harm.",
        "date": "MARCH 19 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "When I was in [date omitted to preserve anonymity] we had a fire alarm drill and as I was walking out I was next to this guy. He seemed kinda weird but I was also weird so I would talk to him now and again as I knew what it was like to be an outcast. As we were walking out and I felt what I thought was his arm against mine I apologised and made a joke about it being crowded, I then looked down and realised it wasn’t his arm it was his erection. He just laughed and smiled at me and I pushed through the crowd. [date omitted to preserve anonymity] he got into a argument with my friend after he said he didn’t believe there was a gender pay gap and that rape culture wasn’t real. The only reason I remembered this was the other week he messaged me saying happy birthday and how he wanted to speak to me as we hadn’t spoken in years.",
        "date": "MARCH 19 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I have never told anyone what happened to me, too ashamed and thought it was my fault. I was sexually absused at school when I was 5 years old. I'm now 46 and the result of what happened to me affected me for many years until my friend's daughter turned 5 and it made me realise how young I was at the time and how it couldn't of possibly been my fault.",
        "date": "MARCH 18 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "When I was in grade 4, I when to the bathroom. The janitor was cleaning the boys bathroom. When I was done going to the bathroom he was already in the girls bathroom clean it, which I found weird cuz I only took like 1 minute and he takes like 5 mins to clean. Anyways, he was beside me cleaning the mirror then went behind me as I was washing my hands, he’s private part was against my butt and he was moving his waist around, I pushed him away well tried too and he pinned me against the wall so I was trapped ( I was in between the sink and the wall and he was blocking me so I couldn’t go anywhere ) he started to touch my thighs then worked his way up higher trying to touch my private part. I remember saying to him “ what are you doing, get off me.” And also telling him I was uncomfortable. He didn’t care so I pushed him away and ran out the bathroom. I didn’t even get to dry my hands",
        "date": "MARCH 18 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was sexually harassed by a boy in my class the teachers didn’t do anything even when it wasn’t only me telling them about it",
        "date": "MARCH 17 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "iv never told anyone this before but when i was 13 turning 14 i was hanging around with people much older than me,i remember it was someone birthday [date omitted to preserve anonymity] and there was a boy 16 at the party touching my leg and then i went into one of the rooms to get away and he followed me up and nobody helped and he was kissing my neck telling me to shut up when i was saying no he then fingered me n i wasn’t enjoying it then he made me have s3x the whole time i was crying telling him to get off me he would listen. Once he had finished he walked out the room laughing one of the girls who had just came to the party seen me and asked what was wrong i couldn’t tell her but she guessed as my dress was covered in blood and i had been crying she then made the boy leave.The [date omitted to preserve anonymity] he appeared at the girls house and just acted like nothing had happened im no longer friends with them but i always see the boy and feel petrified every time i see him walk by me.",
        "date": "MARCH 17 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was out with my boyfriend (now husband), my brothers and my friends celebrating my 20th birthday. Throughout the night people slowly started going home. It was [date omitted to preserve anonymity] when I decided I wanted to go grab a takeout and go home. At that point it was only one of my brothers and my boyfriend left out with me. They weren’t done partying and begged me to go to one last club. I relented in the end and went along. Big mistake. When we got into the club my boyfriend and brother went to the toilet so I said I’d go get us drinks. I ran up to the bar and was leaning forward to look at what drinks they had. Suddenly out of nowhere I felt a finger push itself inside of me. I kicked backwards and turned around ready to yell at my boyfriend for being gross. It wasn’t my boyfriend (not that it would’ve been okay if it were and thinking back I don’t know why I thought it would’ve been him he’d never do that in a club without permission!). When I turned around there was a stranger, a clearly very drunk man, I didn’t say a word I was numb with shock. One of this man’s friends appeared and yanked him away from me apologising profusely and saying “I’m so sorry he’s just really drunk” but I could see even his friend who was apologising looked horrified at what his friend had done. I didn’t tell my boyfriend and brother when they joined me at the bar. I didn’t tell anyone for nearly a decade. I made an excuse that I felt a bit sick and we headed home about 5 minutes after it happened. For the longest time I blamed my boyfriend and brother for wanting to go to the club when I’d just wanted to go home. It wasn’t their fault. It wasn’t my fault. It was the disgusting stranger that thought he had a right to touch my bodies fault and I know that now. I stopped going out so much after that and made sure I was never ever alone.",
        "date": "MARCH 17 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I had become friends with a boy in my year at school and began to play video games with him online outside of school. He clearly began flirting with me and I always craved a bit of male attention since I felt ugly so I flirted back with him. Shortly after it got sexual and I hated these types of conversations and always changed the subject if I could but he always brought it back to that. We had chatted for a long time and I just thought that this was how boys were when they liked someone so I just thought it was nice to get the attention. That was until he began telling me all the things he would do to me if we were alone and saying things such as he wouldn't be able to hold back around me. And since we were pretty much in the same class throughout school he would follow me to where I would hang out and chase me so he would hug me tight and bring his friend to make me feel pressured to hug him back. Then my teachers changed seating plans and they put me next to him since he asked them, and that was when it really started to get worse since he would bring me gifts and in return he would expect something which I refused then in classes he begun to feel me up like grabbing my inner thighs in class and staring at my chest and always had his eyes on me. And during science practicals he would \"accidentally\" trip and grab my chest multiple times and I was happy that a girl who I didn't know stood up for me I was thankful someone spoke up for me. But it continued anyway since he would follow me and I would feel his eyes on mine. Then online he began getting worse saying vulgar things and how he felt when he saw me at school which made me feel even more hyperaware of what he would do if he caught me alone. I would lock myself in bathrooms at breaktimes since he knew where I usually went and I just never came into school much. Then he began threatening me online and because I was a stupid kid I gave into those threats and gave him nudes which he then threatened me more with and he sent them to his friends and I never felt more humiliated. I was only 14. I mustered the courage to just block him on everything and speak to teachers in private to let me sit somewhere else and I ignored him in school and always had someone with me since he would try to get me alone. I'm so glad I finished school. But everyday I go to work I have to drive past where he works and I see him. I only decided to write this since he made an alternate account and added me again. I blocked him.",
        "date": "MARCH 17 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was in year seven and was sexually harrassed by a boy. This went on from when we got put into sets ([date omitted to preserve anonymity]) to when I left the school for summer. Luckily I ended up moving schools for year 8. When I was still at [organisation omitted to preserve anonymity] the boy put his leg around mine and pulled me backwards so I was up against him. This was reported to the police after shout called the police for my safety.",
        "date": "MARCH 17 2023",
        "location": "ENGLAND"
    },
    {
        "body": "[date omitted to preserve anonymity] before i was going to start highschool, i got my first boyfriend. He was a year older than me. Our relationship quickly turned sexual and with it being my first relationship i thought of this as normal. he repeatedly asked to eat me out within just a week of us dating and was annoyed when i said no. about a month into dating he asked me to give him head and i did. he asked to eat me out and because i felt embarrassed and uncomfortable with him seeing me vulnerable like that, i said we should just have sex instead. after that first time, he never stopped. on a week when i had my period he constantly complained that he couldn’t sleep with me. every time we hung out we had sex multiple times. we even tried anal because he wanted to and when i cried because of the pain he just sat there jerking off. about 5 months into the relationship we were having sex and i was exhausted. we had already gone multiple rounds and i felt so tired. i got up and tried to put my clothes on but he pushed me down and took them off me. he held me down, hit me and rped me. i froze in the moment, not understanding what was happening to me. after describing this story to a friend the [date omitted to preserve anonymity] at school she told me it was rpe. I suffered ptsd, severe panic attacks and nightmares from this experience. i tried multiple times to get him removed from school to ease my ptsd, the school didn’t care.",
        "date": "MARCH 16 2023",
        "location": "VIRGIN ISLANDS (US)"
    },
    {
        "body": "I was sexually assaulted whilst in this school, the school refused to believe me, I have now been harassed by the boy who did it on countless fake accounts, receiving unsolicited pictures and nasty, sexual messages.",
        "date": "MARCH 16 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "there was this boy who i used to be romantically involved with. he jokes about raping me, makes so many comments about my body and makes comments about touching me to my now boyfriend. When me and this boy were together i thought he was just going in to hug me from behind but he didnt he grabbed my boobs and then laughed about it with my friends. i didnt want him to do that and i was visibly uncomfortable and when i told him i was uncomfortable he said because he was my boyfriend he was allowed to do stuff like that. Even when we werent dating he would grab my upper thigh and would justify it by sayign i probably liked it which wasnt true. he now is still making comments and i cant be in the same room with him without getting uncomfortableor upset i told my school and they didnt do anything about it and this is the second time ive wrote about him on here",
        "date": "MARCH 16 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was shown lesbian porn videos repeatedly in lessons after i refused to come out to people who i didn’t know",
        "date": "MARCH 16 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was 18 and went to a New Year’s Eve party at an apartment in town there was a few guys there that I knew from high school it was a bit weird to me that there was not really any girls there. From what I can remember I wasn’t drunk just tipsy anyway the night started to wind down so I sat on the sofa one guy came and sat on the sofa started making me lay down he started trying to pull my tights down I kept saying no so when he wouldn’t listen I got up and went and sat on the kitchen floor so then one guy that knew. From high school saw me I told him what happened he took me into a room where two people were already sleeping in the bed and he made a bed up on the floor for me to sleep he then forced himself on me even though I kept saying no and trying to get up when he started having sex with me a just froze out of shock and fear I couldn’t believe he did this after what the other guy tried to do on the sofa after he was done I got up ran out the apartment went home had a shower because I felt dirty I didn’t tell my mum for such a long time one of my friends at the time didn’t believe me it’s really took a toll on how I am with guys now I definitely need more counselling to help as it’s nearly been 10 years but I clearly haven’t dealt with it properly when I finally told my mum she knew something was wrong it made sense to her as I was very different to live with I never went to the police which I really regret I didn’t go because you hear so many women not being believed or well you were drunk and I just couldn’t handle that but maybe if I went to the police and tried to get justice it might of helped me I don’t know but either way when you’ve been raped it stays with you forever your whole few on men changes which is horrible",
        "date": "MARCH 16 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "When I was 14 I was in a relationship with a 16 year old for 6months he asked me time and time again if I was ready to have sex and I always said no until the time he just didn’t ask. We was sitting in my bed with my disabled brother I was laying on my side between my brother and my now ex I was facing my brother when it happened however I didn’t try fight or scream because I wanted to protect my brother from what was happening. I got no justice in the end even though they found his DNA in my system but because he said i consented it would of been my word against his and I already sat through this a year waiting for this verdict I was not ready to go through another year of this torture so I did not take it to court, the police should have charged him for statutory rape but they never in the [location omitted to preserve anonymity] you have to be 16 to consent I was 14 so why nothing was done I don’t know it’s now coming up to 3 years since it happened I’m now on anti depressants been diagnosed with anxiety depression and ptsd and still in therapy !",
        "date": "MARCH 16 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was cornered in a classroom by my classmate and his friends during lunch. This guy assaulted me and then lied that he did nothing.",
        "date": "MARCH 16 2023",
        "location": "ENGLAND"
    },
    {
        "body": "From [date omitted to preserve anonymity] 8 I would always get messages from boys at school to send nudes and would always feel pressured to do so. One [date omitted to preserve anonymity] I gave in just so they would leave me alone and then they screenshoted it and it got around so quickly. In [date omitted to preserve anonymity] I was in a relationship with a boy in the [date omitted to preserve anonymity] above who would always want to participate in sexual acts and one day he wanted to walk me to school where he then took a “short cut” and assaulted me. I couldn’t physically get him off and that makes me regret my choices to this day. I’m now in year 12 and there’s not a day that I don’t think about it. It’s to normalised now days to participate in sexual acts at such a young age which makes young girls feel pressured to say yes to nudes or participate in acts they don’t want.",
        "date": "MARCH 15 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "He put my hands down his trousers. Without asking, not aggressively, but the consent wasn’t there which I would’ve wanted.",
        "date": "MARCH 15 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was in a relationship with this boy for [date omitted to preserve anonymity] 2 years and he was my best friend. I trusted him, since he never gave me a reason to not. So I sent when he asked because he promised and promised he wouldn’t save. It never came up that he saved, screenshotted, screenrecorded or anything of that. So I thought nobody had this picture but me, which is what I wanted. [date omitted to preserve anonymity] and about 5 months since we split (not on bad terms) we were talking again to which my friend came to my classroom and told me some random boy has this picture. I had to sort it out myself since I didn’t think the school would do anything but tell my parents/ police. I will never be able to trust somebody again.",
        "date": "MARCH 15 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "At school [date omitted to preserve anonymity] in [date omitted to preserve anonymity] a boy in my computing class asked me for s3x and said if I didn’t do it he would come to my house and r@pe me. I told all my friends about it when I had learnt that this boy had been harrasing them all several times by touching their thighs,rubbing their arm ect. I couldn’t tell the teachers because the teachers in my school aren’t trustworthy and I do not feel safe there. I had told my parents to contact the school and tell them about this boy and the school forwardly said “boys will be boys. He was probably just playing around with the girls.” My parents were furious with the response and sent me to another school I am in [date omitted to preserve anonymity] 9 now and feel so much safer.",
        "date": "MARCH 15 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was dating a boy in [date omitted to preserve anonymity] when I was a fresh year 10. He was the sweetest boy for someone who was mentally unstable. He was very keen about everything in our relationship as we had been friends first. He came to pick me up from school one day with his dad and they told me he was coming home with me. I was so happy coz I was getting to spend hours with the boy who “loved me” from that day til [date omitted to preserve anonymity] he was always at my house after school and on the weekends. I was constantly sexually harassed and abused by him. It started as consensual making out and kissing then he kept trying to get me to touch him or let him touch me. I consistently said no thank you and I don’t want to not now because he was a fresh boyfriend but he didn’t give me a choice. He would get me to lay down with him thinking he had let it go and then pull out his dick and put my hand on it and move it up and down. That went on for a few days and as uncomfortable as I was I would have rather it stayed that way then what he did next. He then would almost snap my neck forcing me to give him head and it got to the point he hated being refused that he learnt to pin me down and sit on my chest so I couldn’t go anywhere. He then forced his way to my boobs and trying to finger me. I told his mum about it not know any of it was wrong. She told my mum and they forced me to tell the police and social services. I had a female social worker and one of the police officers was female the other was a male. The entire time I gave my statement he looked at me like I was lying all my friends chose him over me and I didn’t see my best friends family for a year coz they live in the same street. He got away with being a dirty little boy because I was too broken to pick myself up. I still see him in the streets and panic to the point I don’t leave my house and it’s vile.",
        "date": "MARCH 15 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I have been groped by multiple male students.",
        "date": "MARCH 15 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I’ve been catcalled multiple times by older boys. I have repeatedly told staff members but they haven’t done much at all.",
        "date": "MARCH 14 2023",
        "location": "ENGLAND"
    },
    {
        "body": "I was touched-up during lunch by a group of boys.",
        "date": "MARCH 14 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "In [date omitted to preserve anonymity], I got my first boyfriend. I was adamant I didn't want to do anything sexual until I was 16. Once when I was 14 and we were kissing, he got his penis out and placed my hand on it. I didn't know what to do so I pulled my hand away without saying anything. He put it back there multiple times until I gave in. When I was 15, he talked about sex a lot and eventually convinced me to try. I was uncertain. I didn't like it, it hurt. He became more sexually aggressive and abusive throughout the relationship, eventually turning pressuring and guilting me in to sex in to masturbating over me while I slept. And then initiating sex while I slept. And then raping me in ways which became more violent. It was clear at the very least he was abusive in school. Especially in Sixth form where he would linger outside of my classes and stare at me through the door during his free periods. Or him grabbing me by the wrist to take me somewhere to reprimand me. For 3 years, he regularly raped me.",
        "date": "MARCH 13 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "When I was in year 3, a boy in my class was a year older than me due to being held back. In an ICT lesson, he was sat next to me because I was quiet and teachers hoped he would be less disruptive. He took my hand and made me touch his penis. I pulled away and he did it several more times. I went to tell a teacher but didn't know what to say. I settled on that he was upsetting me and making me touch him but they sent me back to sit next to him. He put his hand on my crotch and I got up again and started crying. The Teacher moved me but never asked what happened.",
        "date": "MARCH 13 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "my friend asked me to go over to her house to make sure whenever she woke up with her hookup her little brother and sister didn’t see him. Whenever i got there he started being weird and like putting his arm around me then it was my thighs then he grabbed my head and tried to make me give him a bj i refused and thank god my friend came in so he stopped he also made me touch him i didn’t know what to do so i just froze. till this day i still feel his hands over my body",
        "date": "MARCH 13 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I’m barely surviving. I’m hanging on a threat. I started smoking even though I know that it’s bad for my health but it’s like when I cut myself it’s like an escape. I’m constantly feeling sad and helpless and I’m writing here how I suffer. Theres no ending. It’s like a circle no beginning and end. I hate everything about my life and I feel so damn lonely. Especially every friend I have got now a significant other and I’m still lonely like I have always been. And I’m embarrassed of myself how I am acting and how I feel. I don’t want my friends to worry so I just keep these feelings to myself. When I smoke my whole body is trembling and I know that isn’t a good sign but at least my body is giving me a sign that I’m still alive even though I feel dead inside. Every time I meet my friends I put this mask on and act like I´m happy like there’s nothing wrong with me. I wish someone could see through me and see how much I’m suffering. I wish I could express my feelings to someone.",
        "date": "MARCH 13 2023",
        "location": "GERMANY"
    },
    {
        "body": "I went to this party, and i was pressured into taking and drinking things i didn't really want to. As the night went on i was very clearly not in the right mind, and I ended up kind of falling asleep over this chair in the corner of the room. Some boys that where at the party started taking pictures of me, as my skirt had rolled up to the bottom of my stomach and posting it on their story ( i didnt know at the time). Then this one boy came up to me (this is when i was starting to realize what was happening) and started grabbing my boobs and putting his hands in my mouth, and I couldn't really stop him. I was so humiliated. The boys then where laughing and left. When i woke up the [date omitted to preserve anonymity] all this stuff was on peoples storys and even all the girls where laughing about it. My boyfriend then broke up with me, even when i tried to explain to him that i didnt want them to do that. Those boys where 16, and i was 13 at the time.",
        "date": "MARCH 13 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "She did things to me whilst i was high.",
        "date": "MARCH 12 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was assaulted by my boyfriend and then left him. He stalked and harassed me for weeks to come and the school decided that it “wasn’t their issue” so allowed him to stay in the school where I was, even after he hit two of my friends, followed me home and left me almost 30 voicemails a day. he threatened suicide on me and the school wanted no involvement. i struggled so much",
        "date": "MARCH 10 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "My boyfriend at the time pinned me to the ground in the park and made me give him head. Taking his penis out in my face.",
        "date": "MARCH 10 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "After a whole term of close friendship with a boy in the same [date omitted to preserve anonymity] (we joined new at the same time) he began ruthlessly bullying me with no cause. He was emotionally manipulative towards me as well as being verbally abusive whilst still keeping a ‘nice-guy’ persona to the rest of my year. After accusing him of making inappropriate sexual comments towards me he claimed I was lying and had made them up, claiming that I was saying all of this for attention. I felt completely alone. Most of my year didn’t care instead labelling me as a bitch because he was ‘such a nice guy’.",
        "date": "MARCH 10 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I have this person ([name omitted to preserve anonymity]) that I have know since Primary School. He is a boy that has a few friends, some again from primary school, but most now from Secondary School. His friends do sometimes take part in sexual banter and this was the case for a few years in my late primary school years and early secondary schools with one person ([name omitted to preserve anonymity]) in particular but he has definitely calmed down when he is around me now. [name omitted to preserve anonymity] has taken M2’s sexual banter and turned it up to 100. M1 has repeatedly made taunts about wanting to finger me and wanting to kiss me and has now started to touch me in areas I do not want to be touched. I’m afraid that if I take it to the teachers that they will do nothing about it as the last time a group of individuals bullied me, the teachers just told them to stop in their usual way. Thankfully, they did stop but I can’t help but wonder if more could have been done, especially since they were doing it for money.",
        "date": "MARCH 10 2023",
        "location": "WALES"
    },
    {
        "body": "i was sexually assaulted in my first year at college by a student the year above i reported this and the college pulled him up on it, he was still allowed to attend college as he only had a few months left. during my second year he was invited back to play in a gig at the college because it was outside college hours however he was using our college studio to practice with his band mates i wasn’t told he would be returning and the college haven’t done any thing about this",
        "date": "MARCH 09 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "when i was 13 i was on a hang out date with a boy i liked, who knew i liked him but did not like me back. i was bent down tying my shoelaces when he came up behind me and shoved his fingers up my vigina. he looked at me while i stod there shocked in this awkward and volnorable position. i didnt push him away or yell, i was frozen. mind you i was wearing a skirt and even had a tampon in. it hurt.",
        "date": "MARCH 08 2023",
        "location": "NORWAY"
    },
    {
        "body": "While I worked at this school probably in [date omitted to preserve anonymity] a student in [date omitted to preserve anonymity] 9 aged [date omitted to preserve anonymity]. Announced to the class that he was going to drop his trousers in front of me. He then proceeded to drop his trousers in the class in front of me and everyone. I sent him out of the class and reported it to the Headteacher. The boy told the male Headteacher that his trousers accidentally fell and the Headteacher believed him and there were no other further actions or sanctions for that student.",
        "date": "MARCH 08 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "i was sexually assaulted by a boy in class he groped me and kept moving his hand closer up my thigh when i told him to stop, i told a councillor. nothing was done.",
        "date": "MARCH 08 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "My teacher [date omitted to preserve anonymity] or [date omitted to preserve anonymity] during a sociology a level class showed us this website with all the submissions on it and it made me think of something that had happened to me. I am in a relationship currently(F), but i cheated with my ex’s best mate([name omitted to preserve anonymity]) on my boyfriend. It sounds awful but this is what happened. so my ex’s mate [name omitted to preserve anonymity] asked me when his parents were out to come over, so i did. I told him at the start i didn’t want anything to happen because at the time i was in a relationship with F which was (is) going so well. However me and [name omitted to preserve anonymity] had flirted in the past so we had a bit of flirting going on but i didn’t initialize anything first. We’re in [name omitted to preserve anonymity]’s room and he starts to kiss me then moving his hand down me and i asked him “what do you think you’re doing?, like we’ve already gone to far this is enough” so i tried to move but he continued and said to me “don’t lie to me this is what you want” . At this point in time i already felt bad for meeting [name omitted to preserve anonymity] in the first place when i’m with [name omitted to preserve anonymity] then forced me to give him head as he sat me up himself and kept making me gag on his parts. he then turned me over and did it . I said nothing. i actually think my body was in shock so much that i couldn’t physically and emotionally comprehend why this boy was doing what he was doing. during intercourse he kept going deep and slamming into my behind. i went to the toilet and i started bleeding. a lot . i cried a bit but i was thy weak i couldn’t build myself up to the fact of what happened. I left my [organisation omitted to preserve anonymity] location on which i didn’t realize, so when he went back on his phone his mates were messaging him including my ex calling him a “homie hopper” because of being with me. He then told them that nothing happened between me and him and i couldn’t tell the truth because i’m in a relationship with F so i lied and said nothing happened. Since then i snap J sometimes but have never brought myself round to sharing this with anyone even F when i’m still with him, i could never tell him it would break him and me even more. After that happened it just made me consider how grateful i truly am for F because he’s so understanding and patient and you can tell how much we adore each other . Just a life lesson to not cheat to be fair and be grateful for what you already have.",
        "date": "MARCH 08 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "i was 14.he was 15. it was the [date omitted to preserve anonymity] when i went to see a boy i was close with, we went to a town i lived 25 minutes away from and we walked across a bridge where there was public bathrooms. i knew where it was going and i asked him to walk back the other way. he said no. he dragged me into the men’s bathroom. the last stall i remember was the biggest one , that’s where he dragged me into. i froze. next thing i knew he was kissing my neck and putting his hands up my bra. i told him to stop. i asked him to leave. he said no. “u barely get to see me ur gonna regret this when u go home , it’s only gonna be a few minutes ur gonna have fun i promise” i told him i want to leave , i tried to get passed him he just grabbed me and pushed me against the wall. i tried to pull him off. he started to pull them my leggings as i started to cry. he turned me around and gripped me tightly as i was pushed to the cold dirty ground. my face was against the floor and he had my hands on my back and he held them tight. “i want to leave let me go i don’t want to do this” he didn’t listen he didn’t care. he put his genetils and started rubbing around my private part. i had no control i felt so weak and in that moment i knew he was dead to me i never wanted to see him again. he put his dick literally up my bum and tears rushed down my face. it was so sore like nothing i’ve ever felt before “this is hurting me can you please let me leave” he kept going. i didn’t see him again after that , we aren’t in the same schools but i still think abt it every day. i feel dirty i can feel this hands on me at all times. i didn’t deserve what he did to me , no one ever would",
        "date": "MARCH 08 2023",
        "location": "IRELAND"
    },
    {
        "body": "My letter I need to get it off my chest Dear Perpetrator I hate you, I hate that I see you happy and smiling in school while I’m crying and falling apart, barely able to be there. I want you to suffer. You made my life a living nightmare for years though you weren’t even there, the affects of what you did have lasted to this day. I want revenge but I remember you were a child as well and then I hope you have never experienced what you did to me. I pray to gods that I don’t believe in that it was just some sick thing you saw on the internet. I hope I was your only victim and that I will be the only one I wouldn’t want anyone else to go through this I would send you to prison but it’s my word against yours I don’t think my chances would be very high of anything happening unless there are other victims but even then it’s low. You should have never walked back into that room and You should have never said sorry, it was such a pointless waste of air when it meant nothing. I don’t accept or appreciate your ignorant apologies when it’s was given right before you did something immoral, unthinkable and cruel to me. A Fellow Child And Human Being",
        "date": "MARCH 07 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was 12 years old when i first started cutting ad another form of self harm, i had tried self harm as a form of coping mechanism before but i couldn’t ever get my spin to peirce but this time i had found a blade and cut my leg about 6 times. It scarred up and the [date omitted to preserve anonymity] i did it again, another 5 (This time i went deeper). I was sat in bed with my mum and my school trouser leg lifted up, showing the cuts that had now scabbed, on my legs. I told my mum it was my dog but i knew she knew it was self harm, I went to school and by the time i got back i confessed to my mum about my self harm and she told my school without my consent or telling me. My school did nothing to support me or help me when they found out about my self harm and i told my mum i would never self harm again. I was supposed to reach a year clean in 20 days from the day i wrote this but i relapsed 2 months before i was supposed to reach a year clean. I never confessed to anyone about this but all i can say is that my school didn’t attempt to help me, they caused me to relapse when i opened up to them about having a stalker and after he sexually assaulted me on campus i told a staff member and they laughed it off and said he was just being silly because he was “confused” and “didn’t know”. In the same year i was sexually harassed by a 17 year old boy in a room with CCTV. He pulled out his penis and started masturbating infront of me and looking at me at a close distance (About 2 Meters). I was shocked and stood still and was so scared to leave in case he grabbed me or tried to hurt me so i stood there, I feel like it was my fault but after my school found out when i opened up and it was all on CCTV for proof they told me he didnt understand and he was confused. The sexual harrasment and assault gave me flashbacks from when i was sexually assaulted by 3 different men (With no connection to eachother) and got my innocence and rights taken from me when i opened up about it i was silenced. I HAVE A VOICE, AND I WILL NOT ACCEPT BEING SEXUALLY HARRASED(ASSAULTED) BY 5 DIFFERENT MEN AND I WILL NOT BE SILENCED. This is the first time i have opened up about it. (This is all true i really hope you beleive me i am only 13.) - [name omitted to preserve anonymity]",
        "date": "MARCH 07 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I had just started university and quickly got into a relationship with a second year. he was sweet and charming all that would be ideal in a boyfriend. he began to get jealous of my male friends very fast and dint like it when I spent time with them. this went on and on for months but I brushed it off after many arguments I decided to end it for both of our mental health as it became physically draining for the both of us. after I started hooking up with a new guy and it didn't take long for my ex to find out. he was jealous again and asked to meet me at mine to talk about it during a night out. I agreed as we still had many of the same friends and were both in the same society and just wanted life to be as easy as possible. we started talking in the back garden of my accommodation which quickly turned to him yelling at me. I could tell that the rest of my house was still awake so asked him if we could continue in my room so I could save the embarrassment of my ex yelling at me. after we got to the room the conversation didn't continue I went to the bathroom and came back in. next thing I know is that he was pinning me down and I froze. I had no idea what was happening as I had too many drinks. the [date omitted to preserve anonymity] I told my friends and the guy that I started seeing. we went straight to the clinic and I told one of my and my ex's mutual friends as they all wondered why I went cold after he told them about us \"hooking up\". no one believed me and thought I made it up because I regretted sleeping with him as it would have ruined my new relationship. people thought that it was the easier thing for me to say so I just went with it. I've lost everyone. all the people I spent my time with [date omitted to preserve anonymity] chose him. they didn't even ask me for my side of the story. I had to leave my society and with that lost a lot of my friends with it. I'm too afraid to go out to my uni town now because I know ill freeze if I see him. He gets to walk around carefree like nothing happened that night than two exes who slept together again drunkenly. I'm too afraid to drink anymore.",
        "date": "MARCH 07 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was in my third year at university and had recently split up with a boyfriend of seven years. I had gone on a night out with some girlfriends and bumped into a new, male friend who I had only started socialising with. I did fancy him so spent some time in the club flirting and having a couple of drinks. I had been drinking so I was drunk, but all of a sudden I was incredibly drunk and not in control. My memory of the whole night is very hazey. I’m not insinuating he put anything in my drink, I had been drinking and at the time I was going off the rails and was drinking a lot so it is very likely that I had drunk too much. The next thing I woke up in a room that I didn’t recognise and I was completely naked. I realised I was sharing the bed with someone and was actually relieved when I saw it was him and not a complete stranger. I asked him if we had had sex [date omitted to preserve anonymity] to which he replied with a yes so calmly as if it was all fine. I do not remember leaving the club, let alone arriving at his house and being undressed! At the time I was in a really low place and had no self-esteem. And I am ashamed to say that I had consensual sex with him in the morning. At the time, I didn’t understand the severity of what had happened and I was just grateful I wasn’t alone. It’s been a few years now and it’s something I think about a lot. I blame myself for not seeing what was wrong with it and sleeping with him in the morning. As I can’t remember the night at all, I also constantly wonder what happened during the period of time between leaving the club and waking up. I question myself all the time about how things could have happened - how did I get up the stairs, how did I get undressed, how could I have had sex?! I’ve been reading a lot on unacknowledged rape which is where this meets the legal definition of rape but at the time the victim (me) didn’t see it in that way and saw it as a misunderstanding or a bad night. I am still very confused about the whole thing. I don’t think he is a bad person but what happened was wrong. We continued to be friends and classed it as a one-night stand.",
        "date": "MARCH 07 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "im in year 10, i recently dated a boy in the year below lasting about 3 months. one day he invited me to his house and we made out (consensually), things were fine but everytime i would say can we slow down he wouldn’t and just kept on going , and at one point he even pinned me down under him making out but i openly pushed him away but he just didn’t get off, in the end I turned my face away multiple times and just said can we not do it like this. He was clearly a little bit unhappy. He also kept trying to get into my bra but I said no but he kept trying so I was like not [date omitted to preserve anonymity], this went on for the whole evebubg. Then [date omitted to preserve anonymity] we met up at his house again and it was just bad. Like we made out consensually at first but then he kept pushing and pushing for me to sit on top of him in a specific position. Like and make out that way, he did it to me but I kept saying maybe not or finding excuses but he still did it . We couldn’t even watch the TV because he would not get his hands off me for two minutes and just watch the film. Then later on he kept using this excuse saying people form school have said we should do this or that etc etc and then said they’re saying I should finger you, I said maybe not [date omitted to preserve anonymity] because it’s a bit too soon. Then he proceeded to show me his hard penis and put my hand on it. I left it there a for a few seconds because I felt bad and then took it away. I was uncomfortable and tried to get him to put it away but he kept trying to make out with his penis outside his pants while on me but I kept pushing him away saying maybe put it away. Eventually he put it away, thank goodness but he kept trying to get inside my bra , I was wearing an open neck top so he could feel my chest, not boobs, I was okay with this, but wasn’t tooo keen. Then he kept going inside my bra and I would put my hand over it so he couldn’t get to my nipple or anything but he kept trying to move my hand and kiss it. It was actually disgusting but there was genuinely nothing I could’ve done . Like this kept going on, eventually he just restrained my hands and said wait a minute you’ll love this and proceeded to kiss my boobs and stuff. Like I genuinely didn’t want this, but he kept doing it, i also kept saying maybe later maybe later to try and delay it. I understand I never said ‘ no’ to the boob stuff but I said maybe another day and I was clearly uncomfortable and told him to please slow things down. Eventually 10 mins before dinner I told him maybe u should wait for ur penis to go floppy because ur parents might see. He then said his parents wouldn’t mind, so I was like but it won’t look good on me and it’s important for them to like me. He stopped the boob and penis stuff but kept pressuring me to make out and get on top of him. I did it once to make him happy and so he would stop asking. And then dinner came. After dinner I used breath bot smelling nice and using that as an excuse, he bought it but kept pressuring me, but I kept persisting with the excuse until my mum came to pick me up. Then at school this rumour that is did a hand job on him went round. I denied this and told one close friend (who doesn’t gossip at all) that he put my hand on his penis, not realising it was sexual assault until I got called in by the school . I only told them about the penis stuff as that was what was reported and soet of defended the boy in a sense because she said she may have to get the police and my parents involved. Because I don’t get on well with a parent and couldn’t risk this coming out I defended the boy saying he just got too caught up in the moment and it was nothing serious. When he got interviewed about the penis stuff the school concluded that it was ‘experimentation’ that went a little too far. my reputation is trashed because of this and it’s horrible that he can just get away with this but I know I hould’ve said something when I was getting talked to.",
        "date": "MARCH 06 2023",
        "location": "ENGLAND"
    },
    {
        "body": "After a 3 year abusive relationship at 17, I fell into a bad habit of sleeping with guys so I felt good about myself. This boy who I went to school with, who was 4 years older than I was messaged me on Instagram. He was a very popular boy and so I was surprised why he’d want to talk to me. We had the same humour and spoke for ages. After the small talk ended he got sexual and flirty and asked when I could go over his. I knew it was for sex which I was ok with so we arranged a day. When I arrived he started kissing me straight away and I instantly I felt out of my depth. I brushed him off with a joke and hoped he read the room. He did and we sat on the sofa and spoke for a while. Eventually he started again in a nicer way and after we did some things we went upstairs. We were kissing and he was doing things to me when he grabbed my neck and sat me up. He took his boxers down and said “ let’s see how good you are” I really didn’t want to, I felt panicked and thought he was coming on a bit too strong so I said no. He kept prompting me saying “that’s what you’re here for”I felt scared incase he didn’t like what I was saying, but he grabbed my head and forced my mouth on him, he was so aggressive but after a few times I managed to pull away. He turned me over and pinned me down and said “that’s how it’s going to be is it?” We then had really rough sex which hurt. I didn’t speak or make a noise, It was awkward when he stopped, he didn’t talk to me and left the room. He left me there with my face down, I got up, got changed, I looked back at the bed before going downstairs and there was my blood everywhere. When I got home I was still bleeding, I had bruises on my chest and neck. It took a week for the pain to stop. We haven’t spoken since.",
        "date": "MARCH 06 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "Frequently, boys encouraged each other to take photos of girls. The majority of these photos were angled towards skirts, which many girls expressed how uncomfortable it made them feel to both teachers and the students involved. Very little was done to resolve this, and the behaviour was excused. Personally, I was made aware of a group chat where boys discussed what they wanted to do with me in bed. I felt unable to approach teachers about this matter after hearing about other people’s experiences. In addition, one time in class we had a cover teacher. He told me to come up to the front of the class, which was not uncommon if they needed a student to run to the printer. When I reached the front of the class, he told me to grab the bottom of his shirt so he could take his jumper off. I panicked and did as he asked, as I was scared of questioning his authority. It was only after class that I felt ashamed and embarrassed, as the entire class was laughing and joking about the situation. I still don’t understand why he needed anyone to hold down his shirt, let alone a young girl. A few years passed, and we had an ‘own clothes day’ for charity. It was a fairly cold day and I was wearing dungarees. He saw me down the down the corridor, and started pulling on the waist area of my dungarees, laughing and joking about how I must be cold. Of course, I took this as a joke, but looking back on both situations I feel extremely disappointed in his behaviour as a teacher.",
        "date": "MARCH 05 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "When I was younger I was sexually assaulted for almost a year by a grown man. It traumatised me a lot but I managed to live with it. A boy who sexually assaulted one of my friends started texting me [date omitted to preserve anonymity]. He said weird sexual things as a “joke” but that’s just what boys my age do and I didn’t think much of it. [date omitted to preserve anonymity], it got a lot worse. The conversation started of normal, over Snapchat we were talking about my ex friends and calling them names. Then the conversation escalated A LOT - he starts talking about his looks and telling me to be honest everytime I say he’s not good looking. He then starts asking me how old would I want to be to have sex. We’re 12. I told him 16 at the youngest because I don’t want to be a teen mum and he replied with “I have a condom” he then continues to ask me about my boobs and then I half swiped and he asks me for a picture and I don’t open it because I don’t know what to say and he gets mad and tells me to stop being a beg and he was joking. He sent me a video of him jerking off. And he asked me if I wanted to have sex with him when we were 14. He changed it to 13 after, I said no the first time. He pressured me into saying yes. Saying “why?” “I want to do it with you tho” he keeps making weird sexual statements after I’ve made it obvious lots of time I don’t wanna talk to him, leaving him on delivered, not replying, making up excuses saying I have to go. He’s still harrasing me now - as I am writing this. I was telling all my friends, laughing with them on call at first. It’s sunk in now. And it hurts. I just want to cry. I have to face him [date omitted to preserve anonymity] at school. I’m scared. Im going to block him but I still have to see his face. I feel so trapped.",
        "date": "MARCH 05 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "[date omitted to preserve anonymity], First lesson on a [date omitted to preserve anonymity]. I sat down next to the usual guy I do and he started touching me in ways i could never forget. I was and always have blamed myself on why he did that to me. Yes i was in uniform, Yes i am male, Yes i told him ‘no’ and ‘stop it’ multiple times. Yes it happened during class. Despite all of this happening to me I refuse to expose his name as even though i have a strong hatred towards him, im a kind person and dont want to ruin his future and i know thats probably wrong for me to say. I hope one day i can accept that it isnt my fault.",
        "date": "MARCH 04 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "i was raped as a child by who i thought was my best friend in a corner of my very own nursery- more than once- im safe now but that still hurts-",
        "date": "MARCH 04 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was raped in the first year of University by a friend of a friend from my home town. I had got to know him a little bit and we met once for a drink and we shared a kiss. He asked me if he could visit me at University the [date omitted to preserve anonymity]. I was very reluctant but he was very pushy and dominant and I ended up agreeing. I had arranged for him to stay in my halls of residence room and I was going to stay with my friend in her room. First we went bowling. I didn't drink because I was driving. When we got back he guilt tripped me into staying in my own room, repeatedly saying, \"don't you trust me??\". He had got me a drink of water without me asking and looking back I realise how insistent he was that I drank it all. I was oblivious at the time. I don't remember much detail at all about the [date omitted to preserve anonymity] 5 [date omitted to preserve anonymity]. I remember him locking the door. I remember him on top of me. I remember saying no again and again and again. Next thing I recall I was violently sick in the shared bathroom at the end of the corridor. I went to my friend's room and begged to stay there. The [date omitted to preserve anonymity] I went to my room and said I don't really remember [date omitted to preserve anonymity] but I'm going to my lectures now and I want you gone before I come back. I only told 3 people, that was the [date omitted to preserve anonymity]. One of them asked me, \"Well, what were you wearing?\" I have spoken about it in therapy sessions but I would never go to the police as the process would be so distressing and only 1% of rape reports end in conviction. I am 49 now and it still affects me to this day.",
        "date": "MARCH 03 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was sexually assaulted numerous times in highschool. All by boys. Twice by boyfriends. A couple times on crowded stairwells. It wasn't until [date omitted to preserve anonymity] when i was in my first seriouse relationship at 16. That my boyfriend who was 18 coerced me after weeks of asking and begging and pleading to have sex with me, did. I didn't want but It's normal for girls that age to start righ? That's what he made it seem to be and he just kept asking and asking. Just over 3 months. Must have been what, 3 and a half ? I regret giving in so much. Iv grown so much and looking back I was still a child. He abused me as a child. Before we got together, inbetween the begging of going on dates and such, he'd seen another girl. He'd been intimate for his first time with her once. Then came back to me and I believed his words of wanting me. Boys make me sick and physically recoil now. He knew of what others had done to me before him, he still did it. Some of them didn't know me, some did. Boys are vile.",
        "date": "MARCH 02 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I really can’t tell and it hurts. I was coming out of school as I had to give in some pumps and my shoes broke. One of the boys grabbed me by the waist and pulled me closing saying your safe beautiful. Also, I was catcalled again in school. I was 12 in year 7 and he was 15/16 year 10. Please say it’s valid I really can’t tell and I don’t wanna be overreacting but I didn’t ask for it at all",
        "date": "MARCH 02 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was 13 and outside of school I consented to a boy from same school (14-15) to kiss me in a park. Within what felt like seconds he had his hand in my knickers and was violently trying to finger me and I said to him no. I wasn’t confident as I was half frozen whilst saying it. He continued until I cried. I foolishly thought he just wanted to kiss me and he started having a go and made me feel stupid for only wanting to kiss. I had never even thought of anything else being on the radar at such a young age. He humiliated me called me frigid and I remember feeling so ashamed and feeling stupid for being young. He even said ‘I should have expected this from a [date omitted to preserve anonymity] 8’ He left and came back with his friends and they all laughed at me. He then unbuttoned his pants and tried to have sex with me. I froze and didn’t know how to react. I wish I could have pushed him/ kicked him/ screamed at him but I felt paralysed with fear and shock. It was probably only moments but this replays in my mind every day. I’m still trying to figure out what actually happened as I was so distressed I tried to blank it out but I think he did penetrate me. My knickers and jeans were covered in blood and I was so sore for days. I went back to school on the [date omitted to preserve anonymity] and he had spread awful rumours about me and I was so ashamed. I was bullied and tormented about this for the rest of my time at school. On the week at school after the incident, my head of year pulled me out of my form class. He said he had heard ‘disgusting rumours’ about me. At this point I thought he was coming to me with concern however the teacher went on to say “I should watch what I get up to or I’ll get a reputation” I felt crushed, helpless and scared. After that day I faked an illness to my dad so I didn’t have to go back to school for a few of weeks. I remember lying in bed crying for days. I self harmed and never told anyone. During this time getting messages on [organisation omitted to preserve anonymity], my phone and even notes through my door and people calling me a slag and a slut. When I returned after this I was really badly bullied by the older girls from 2 years above me (the same year as him) they made my life hell. The gossip eventually died down once that year group left school but peoples opinions of me didn’t. Even [date omitted to preserve anonymity] some people still refer to me as the girl who got fingered/shagged by person x. I wish I had the courage to allow this to be published but I’m still scared of the back lash. Unfortunately my incident was one of many and the victims were always made to feel dirty and disgusting by teachers, even the school nurse. Boys ruled the school and staff allowed this and the horrible culture to happen. This incident has affected my relationships so much. I’ve never shared this with anyone apart from my close friends at the time [date omitted to preserve anonymity]. Thanks for holding this space for me to share this.",
        "date": "MARCH 02 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "There was this boy he walked into the girls toilets unlocked my door and he started hitting me telling me to take my shirt of and this lasted for a 1 hour and then the teachers wouldn’t belive me and I got a 2 hour detention for skipping lesson",
        "date": "MARCH 01 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "Boy was dared to slap my ass and asked me to stand up so he could, I punched him for it and I was punished but he wasn’t (by a female teacher as well)",
        "date": "FEBRUARY 28 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "On a daily, boys at my school threaten to rape girls. There have been leaked messages of boys planning how to rape girls in my year, the school are aware yet they do nothing. Sexual rumours are spread about people (such as myself) within the school which make me feel so low and embarrassed. When i am walking in my PE kit boys will shout sexual comments about my body leaving me uncomfortable. So many teachers are aware yet nothing is done about it. Teachers will flip the blame onto girls saying how it is our fault or try to say we are being aggressive or starting drama. I feel unsafe around boys in my year and i feel as if girls in our school are silenced.",
        "date": "FEBRUARY 27 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was assaulted by my ex boyfriend I was 13 this carried on for 3 years he hasn’t been confronted about it at all whilst I live with all the after math and he is more believed than me and people destroyed my reputation including him and only just now I am trying to heal and rebuild my life again",
        "date": "FEBRUARY 27 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "Whilst I was in Year 9, one of the girls in my Year would often touch my genitals and make me feel uncomfortable. I reported this to teachers but they never did anything.",
        "date": "FEBRUARY 27 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "i was sexually assaulted by a boy in my year group in year 10 and no teachers or students believed me because he was a popular boy",
        "date": "FEBRUARY 26 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "In [date omitted to preserve anonymity] I was sexually assaulted multiple times. I for some reason have blocked it out so well I can't remember it, I am seeing someone to stop my panic attacks but I'm not sure it helping, she's trying to get me to remember but I can't and I don't know why. I feel sad all the time but have to fake it and pretend to be happy and it sucks.",
        "date": "FEBRUARY 25 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "This is a multiple sexual assault stories, our schools toilets for males and females arent seperate they are joined and dont have a door or wall to seperate them. Boys will constantly bang on the girls toilets when people are in there or walk in(which isnt hard) to scare us. Boys at my school pull down trousers and lift up skirts. Pictures of a yr9s nudes are circulating this had led an uproar, where we tried to protest but teachers found out and stopped us from going anywhere during break and being in big groups(this protest was for skirt lengths, mental health and prominent racism). One boy in our school has recorded when someones period is(by listening to a conversation in class)so they can use against her in arguements, this is outrage and should be brought to light!",
        "date": "FEBRUARY 25 2023",
        "location": "ENGLAND"
    },
    {
        "body": "In the summer when I was 13 my family hosted a barbecue with some friends they had a 9 year old son. After we had had our food me and him went to watch a movie in my living room whilst I was watching the movie I felt something rubbing on my lower back realising it was the boys hand caressing me. I was trying to ignore it but then he started to touch under my t-shirt and his hands were now caressing my stomach. I still tried to ignore it but then he started to touch my thigh, this is when I started to worry so I got up and said I was going to get some food, he told me to stay there and he would get the food but I said I was fine and I would get it myself. I hadn’t told my mum for another 2 weeks. It has now been a year since it happened and it’s always stuck with me.",
        "date": "FEBRUARY 25 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "There are so many girls in my school scared to go to school right now because of the way the boys are. Some of the year 8-9 boys always grab our bums and make us uncomfortable but one pinned me down while the other sexually assaulted me. Thankfully the police did something about it and i'm now safe. This happened at [organisation omitted to preserve anonymity] ages 3-16 in [location omitted to preserve anonymity], [location omitted to preserve anonymity].",
        "date": "FEBRUARY 24 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I'm not fully comfortable saying what happened but it happened with a student from [organisation omitted to preserve anonymity], i moved from there [date omitted to preserve anonymity].",
        "date": "FEBRUARY 24 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was in a normal school day when [name omitted to preserve anonymity] was sent to the craft room with me after being more confident with work. He had a broken wrist but he closed the door and said “Let’s not do any work.”. Then as i tried to do my work he was saying jokes like “Take off your clothes.” and “I’m gay, hopefully you are too.”. I was getting nervous and uncomfortable as i kept ignoring him trying to do my work. He was making suspicious jokes and dirty-minded jokes too. He kept itching his private parts and then he kept swishing forward as he looked at me like if he was having sexual intercourse with me. Once he thought i farted and he sniffed my bottom. I got too uncomfortable and i cried a lot but my friends were there to comfort me after that traumatic event, i hated [name omitted to preserve anonymity] after he tried to rape me but my teachers took hardly any action and only took off social time (break time , lunch time).",
        "date": "FEBRUARY 24 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "This is my whole story. I’ve posted on here before but back then I was afraid, afraid of sharing my story because I was ashamed. But now I’m not because now I know it wasn’t my fault. When I was in primary school I was heavily bullied and only really had one friend at the time. This friend was in almost all of my classes which wasn’t an issue at the time really because well I thought she was my friend. She began being really creepy and obsessive later on that year, she would give me pens and pencils that she would boast about having fingered herself with, she would constantly grab at my private parts and play it off as ‘a joke’ but I knew it wasn’t. Then we had swimming together and we had to change in front of our peers but she dragged me behind a wall on the other side of the changing rooms. She proceeded to touch me and grab at me and push me against the wall to hold me in place. She forced me down to feel at her parts and forced me to do very sexual things. She did this about 7 times and I never told anyone. She told me never to tell anyone anything because ‘real friends keep secrets’. I soon got her out of my life luckily and I could not be happier. But this was secondary school and bullying was so much worse. I told one of my friends who proceeded to belittle me and tell me ‘that’s not even a big deal if you’re even telling the truth’. I felt disgusted and ashamed and I just felt dirty. I felt that I couldn’t get the feeling of her hands off of me. I felt like I could never be clean. From a young age I had been self harming and this only got worse. Just when I felt I was getting over it something happened again. I went out on my own late at night to go get myself a small drink and snack from the shops because I couldn’t sleep and the corner shop didn’t shut. When I was walking out I got pulled into this alleyway. This man pushed me against the wall and pinned me there. He touched me, groped me, he made me take his d*ck down my throat and almost r*ped me but I kicked him a lot in a final attempt to get away and I did. I ran for over an hour as he chased me and I finally got away. I don’t feel safe anywhere ever. It’s even harder because I’m trans, and I feel like if I was just born a boy then there would be less of a chance this would happen to me. I feel like I will never be a boy because I was touched in that way. My mental health is incredibly bad but I’m trying my best to work through it These experiences still haunt me and I feel that they always will but I won’t let them control me",
        "date": "FEBRUARY 24 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "This was [date omitted to preserve anonymity] now. I was started to like this boy as he was showing me some attention- calling me pretty and brushing his hands on my thighs. I thought i was special and i did indeed feel like it. One day he was texting me telling me he wanted me round his house- telling me his parents weren’t home and he would buy me take away and we can watch a movie. It was [date omitted to preserve anonymity] by this point. We talked for another hour over messages and i told him i couldnt come now but i could in the morning. He follows this up by a message telling me hes going to get hard if im there with him. I was dumb and still went to his house the [date omitted to preserve anonymity] after these messages. While at his house it was awkward. After awhile we were watching movies and he started to get closer and closer to me to cuddle. He started to get more rough and was pushing his body weight on me and was pintching at my sides and tickling me ans i kept telling him to stop, he kept touching my thighs and my ass as he cuddled me and i kept telling him to get off and i didnt want this but he didnt stop. I ended up pushing him off and awkwardly going to sit with his dog outside his room. He arranged me and dragged me back into the room and carried on. Im 16 and i live with this every day. I blame myself every single day and i still feel his hands on my neck and waist and thighs. He told me to get over myself and that i was being dramatic. I still live with the confusion of if its my fault.",
        "date": "FEBRUARY 23 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "Many girls in my school are sexually assaulted. But infact we are too scared. Boys walk through corridors- mostly year 7-9s, who brush there hands against our crotch or bums. They act like its a mistake when its not. And we know full well its not. A boy in my school sexually assaulted me and strangled me to drag me back to he can carry on. Sick sick men.",
        "date": "FEBRUARY 23 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was first catcalled on the way back from school aged 13. I was so scared to walk down that street again and honestly walking down that area alone makes me feel very uncomfortable, especially at night. I'm 16 now and shouldn't have to feel scared walking around the village I live in. I'm still terrified and have been catcalled multiple times.",
        "date": "FEBRUARY 23 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "when i was in a early year a older boy cornered me in the bathroom just after break and i didn't know what to do and before i knew what was happening he was inside of me, i didn't go to lesson that day. i never went back into those toilets and i never told a soul until recently, it wasn't the first time i was sexually assaulted or raped and it wasn't the last. I've left school now but every so often when someone mentions the school i went to my stomach turns into knots and i can't breathe. I don't know why he did it and i don't know if i was in the wrong place at the wrong time but one thing i do know is that it wasn't the first or the last time he assaulted a women and not once did anyone believe the girls when they spoke out. i don't know why its so hard to comprehend that the men and women you call your mates your siblings you parents your cousins the bloke that buys you drinks, are the most dangerous people for you to be around. after i spoke out about it i wasn't believed and it cause me to develop an eating disorder and to begin self harming, it shouldn't take a victim almost killing themselves due to the way others have caused them to feel to be believed. i hope that any one else who has been a victim of anything knows that WE believe you. i hope that sharing my story gives you a small price of strength and hope that it does get better . you've got this. your not alone.",
        "date": "FEBRUARY 23 2023",
        "location": "ENGLAND"
    },
    {
        "body": "i am gay i dated this boy for nearly a year a full on year!!! all my friends warned me about him and a didn't listen it was toxic abusive and he ended up sexual assaulting me and i didn't want too believe what he done i knew what he done a just thought it wasn't real but it was and my heart still sinks everyday [date omitted to preserve anonymity] he's still manipulating me and trying to get back in my life but for whoever is reading this i feel for whoevers went through this and my heart goes out too everyone",
        "date": "FEBRUARY 23 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I am attending this school and [date omitted to preserve anonymity] I faced sexual assault from another student who was my boyfriend at the time the school didn’t notice anything and when I came forward nothing was done.I also know of many girls in my school who have had the same experience as me and when they spoke up the school simply said that they don’t belive it",
        "date": "FEBRUARY 22 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was standing next to an open door after p.e for some fresh air. One on the popular boys who picks on me pushed him self into me and touches my chest without permission. He played it of saying his pal pushed him to hard. As I walked into the changing room I felt scared,discussed and confused. I looked in the bathroom mirror and therse a mark on my ribs at first I thought it was from my bra but when I got home I saw its still there. I'm scared and don't know what to do. I want to tell someone but nobody will believe me and now I'm starting to blame my self for it.",
        "date": "FEBRUARY 22 2023",
        "location": "SCOTLAND"
    },
    {
        "body": "I am a gay teenage boy of nearly 15 years and i go to [organisation omitted to preserve anonymity]. I am currently in year ten and a boy will touch me and sexualises every comment he makes to me. I hope my principal (Mr [name omitted to preserve anonymity]) sees this as it hasnt been sorted by absolutely any teacher i have told. I have constantly said please dont put him near me as i feel uncomfortable near him and i have told them of the comments he makes. The school hasnt done anything to resolve any issue to do with this and with the current news of astors strikes. We are bordering on another [organisation omitted to preserve anonymity] strike",
        "date": "FEBRUARY 22 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was at the doctor having an ecg and the doctor told me only to take my tights off and un-button my shirt. i layed down on the bed and the next thing i know is that she moves my bra up revealing my breasts without warning and without my consent. i just feel so violated and i haven't told anyone. i dont know if this counts as assault but it still has really effected me.",
        "date": "FEBRUARY 22 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was raped in [organisation omitted to preserve anonymity] - on the university campus when I was 18 in my first year. The perpetrator was known for dealing drugs on campus and the university moved him to cheaper accommodation instead of evicting him entirely. The night I was raped I was also spiked. I only knew I was raped during the [date omitted to preserve anonymity] when I was looking for my bag on campus and couldn’t remember anything from a certain point of the night before. The campus security then traced my phone to the perpetrators flat where he told the student counsellor he had had sex with me “and I enjoyed it ;)”. I told her I hadn’t had sex with him but instead of alarm bells ringing for her - she told me it was a one night stand and I had nothing to be ashamed of. When my mum tried to ring the police in the security office, the counsellor unplugged the phone as “it would look really bad for the university”, luckily my mum had a mobile and rang the police herself. The university not only could’ve prevented my experience from happening but they could’ve made my healing process alot better, instead they prolonged it. I have never been back to [location omitted to preserve anonymity] since graduating and really don’t think I’ll ever be able to.",
        "date": "FEBRUARY 21 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "Throughout my secondary experience I experienced not only sexual assault and being pressured into sexual acts by multiple members of the student body. I witnessed a girl with learning disabilities be constantly harassed by a boy from year 7 - year 11 he would jokingly ask her out, call her fit and make lude comments until her mother finally complained just to be told “oh that’s just *name*” and face no punishment. The girl even stop him to stop and he began to commit these offences to other students only backing off if a boy was involved. I also faced repeated harassment and assault by a specific individual who would choke me out, pull me onto his lap, grope me and even stole my shoe just for people including teachers to watch and do nothing. Several students spread others nudes with people even having sex at school. Sixthform students (16-18) also used to engage in relationships and sexual activities with those in year 8-9 (12-13) and this was normalised. I was once made fun of for not wanting to have sex at 13. The school knew of these relationships. Sexual assault, misogyny and violence against women is a massive issue at [location omitted to preserve anonymity] as well as homophobia. 12-13 year olds are being pressured into having sex and sending nudes and the school fails to act or prevent this. They deserve to be on this list.",
        "date": "FEBRUARY 21 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was catcalled going to the shops, and I wad wearing baggy clothing yet still can't help to think it is my fault that they did that to me.",
        "date": "FEBRUARY 21 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was 15 and at one of my best friend's birthday parties. There were a lot of people there who I didn't know and I was drinking and I believe my drink was spiked. To this day, I'll never be able to be 100% sure whether I was or not and that's a really hard thing for me. There was a guy and we started doing stuff which was initially consensual. I was extremely drunk but I thought it was fine for a bit. By the time we were having sex, I was in and out of consciousness. I was very obviously in no state to consent or understand what was going on. I still don't remember how or exactly what happened. He left me in the room as soon as he was done to go downstairs to his friends and boast that he'd lost his virginity. Meanwhile, I took myself to the bathroom, in a completely shocked and distraught state and luckily was eventually taken away from the party by my friends. He texted me the [date omitted to preserve anonymity] saying he'd heard I was upset and asking why. I told him I couldn't remember exactly what had happened and asked did I need to get Plan B. He told me yes, I definitely should. I didn't really know what had happened. It's only a year on that I've started processing things a bit. I don't like using the word rape but instead sexual assault because that word still feels to scary to me. For a while, I just described it as 'dodgy sex' because I didn't think or want it to be a big deal. I am so angry and upset for my younger self.",
        "date": "FEBRUARY 21 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I have the hat trick in sexual assault and rape. My first assault being when I was around 15 years old. I had been drinking down the park and woke up to a peer with his hands in my pants. Then i was raped by a male in my own home. He stalked and harassed me, picking up all my friends and isolating me. Even my parents liked him and insisted he was my boyfriend. Denying it was laughed off as being shy…. I am not shy. Next was the night I took drugs. Two males walked past me and invited me to a house party. It wasn’t a house party. I woke the [date omitted to preserve anonymity] covered in my own blood, and just walked home. I remember him asking my age because he was considerably older. A few years pass and I’m in a long term relationship. I’m happy. You don’t acknowledge people grabbing your bum on a night out. That’s nothing. But at last I was happy and my vulnerable days were over. Until they weren’t. In [date omitted to preserve anonymity] I went on a hen do with a large crowd of friends. At the end of the night the stag of a party who we had made friends with asked if I would walk back with him ahead of the others as he really wanted to get back. As the stag and a police officer, I had no reason not to trust him. Of course we got back and almost instantly he pinned me down. I had to pretend to be sick to get him off. He did get off. He also apologised the following day. Unfortunately the most recent assault triggered all of my historical trauma, which I really hadn’t dealt with. My friends and family barely recognised me. I almost lost my relationship and my home because of my spiralling behaviour. I never reported anything to the police. Partly because when I was younger I didn’t actually realise what had happened to me. I have never reported the policeman because I will be branded a slag. Instead I worked hard to better my mental health and understand trauma. I work as a nurse and I work with victims/survivors of violence against women and girls (VAWG). One thing I wish someone told me when I was at my worst: It does get better.",
        "date": "FEBRUARY 20 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "It happened [date omitted to preserve anonymity] in [place omitted to preserve anonymity] and he was one of my guy friends who I thought I could trust. we were all at my friends house drinking and I got very drunk very quick so I decided to lay down on the sofa cause I was practically out of it. My guy friend came over who was also intoxicated and the whole night proceeded to touch my boobs, bum tried to kiss me multiply times. I tried to get him off of me and he wouldn't get off as he was to heavy and I was to drunk. my friends at the end of the night pulled me off when I was sobering up and realised what the hell was going on. however it didn't stop there , he then called his sister and said \"I'm going to shag (my name)\" I was upstairs in bed and so afraid hiding under the covers. he tried to come upstairs multiple times and find me however my other guy friends were guarding the stairs and were pushing him down, if it wasn't for them I'm afraid what he would've done as this isn't the first time he has SA a girl. my school found out and [name omitted to preserve anonymity] did not do anything , he has had no form of punishment and it makes me so mad he's been able to get away with this again.",
        "date": "FEBRUARY 20 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "It was my boyfriend. Before we even dated he pressured me into sending nudes as multiple times I said I didn't want to as this was all new for me, when I finally did he decided to show his friends whiteout asking me or even telling me. It got worse we had been dating for a while and there had been incidents where he would make me fell guilty enough that id have to have sex with him otherwise he would be angry , I used to think this was normal and now I know its not and can be is SA. There would be times I would of said no multiple times and he would roll over and not speak to me the rest of the day or he would walk out and say I never want to have sex which made me feel guilty enough that I ended up giving into it and have sex. There was one incident when we were at his and I told him I didn't want to do anything he the continued to get my hand and push it down his trousers multiple times I said no and he still tried and made me touch him, he then gave up and proceeded to try and pull down my trousers after I pushed he hand away he touched me. when I spoke to him about it he pushed my feelings aside and said it wasn't a big deal and that's what couples do, I listened to him and believed it was normal. I now know its not.",
        "date": "FEBRUARY 20 2023",
        "location": "UNITED KINGDOM"
    },
    {
        "body": "I was exhale assaulted at an after school field trip by one of the eighth graders at my school when I was in seventh grade.I haven’t told anybody yet but it has made me have very low self esteem for myself",
        "date": "",
        "location": ""
    },
    {
        "body": "I was raped when I was 15 by someone I thought I could trust. I was too drunk and vulnerable and he took advantage. I had never had sex before or been in any sexual contact with a mans genitals so it was a real shock for me. I feel like I grew up and fell apart over night. It’s taken me many years to come to terms with and not be detrimentally affected by it. It changed the course of so much of my life at a time when I was already vulnerable and alone.",
        "date": "",
        "location": ""
    },
    {
        "body": "I was 14 and my boyfriend at the time was very nice and would never pressure me into doing anything. i gave him a hand job a couple of times and he fingered me once or twice, but i made it clear i did not want to have sex yet. after we had been together for about 8 months and i was 15 he started mentioning sex more and kept talking about it, but i said i’m not ready, to which he replied “it’s not deep but ok.” over the next couple of months this got worse and worse to the point that he would try to put his penis in me if we were doing bits and were naked, and when u confronted he would be sweet and act very sorry. i cant believe i was so naive to not realise how had this was. the main event this is about happened when we had been together for about 10 months and we were at a party. i was very drunk to the point i was nearly blacking out, and he was fully sober because i drank before the party but he didn’t and there were no drinks there. he asked me to go to a room and i didn’t say anything but i went with him. when we were there he said we are having sex and i said no laughing in my drunken state. he forcefully took off all my clothes and put his pen inside of me. i started crying and was trying hard to resist but he wouldn’t stop. he then finished all over me and i just sat there crying for hours. it’s been a year and i’ve only told my closest friends but the fact he’s had no consequences makes me sick and i don’t think i’ll ever be the same again.",
        "date": "",
        "location": ""
    },
    {
        "body": "after saying no many times a boy coerced me into “going upstairs” with him and raped me while i cried and bled and repeatedly asked him to stop. At this point i was called a prick tease even though i had never consented in the first place and multiple people had walked in, leaving me feeling embarrassed and exposed.",
        "date": "",
        "location": ""
    },
    {
        "body": "\"Through the ages 8-12 I was molested and groped by my step sister each night I stayed over as our parents would put our beds in the same room, it was pre puberty and I was clueless that being sexual was a thing and passed it off as a ‘game’ after some years I realised what was happening and I’ve tried again and again since then to get it out of my mind but it’ll never leave - it really did scar me and made me have an innate fear of being touched by anyone around me to this day I even tried to force a kink out of it to Cope but I feel disgusted at the thought (he/him)\"",
        "date": "",
        "location": ""
    }
]